-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 04, 2020 at 08:09 AM
-- Server version: 10.1.39-MariaDB
-- PHP Version: 7.3.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `ict`
--

-- --------------------------------------------------------

--
-- Table structure for table `board_lists`
--

CREATE TABLE `board_lists` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `board_name` varchar(255) NOT NULL,
  `year` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `board_lists`
--

INSERT INTO `board_lists` (`id`, `board_name`, `year`, `created_at`, `updated_at`) VALUES
(23, 'Barisal', '2019', '2020-06-29 03:09:42', '2020-06-29 03:09:42'),
(24, 'Barisal', '2018', '2020-06-29 03:09:47', '2020-06-29 03:09:47'),
(25, 'Barisal', '2017', '2020-06-29 03:09:53', '2020-06-29 03:09:53'),
(26, 'Barisal', '2016', '2020-06-29 03:09:57', '2020-06-29 03:09:57'),
(27, 'Barisal', '2015', '2020-06-29 03:10:02', '2020-06-29 03:10:02'),
(28, 'Barisal', '2014', '2020-06-29 03:10:13', '2020-06-29 03:10:13'),
(29, 'Barisal', '2013', '2020-06-29 03:10:18', '2020-06-29 03:10:18'),
(30, 'Barisal', '2012', '2020-06-29 03:10:25', '2020-06-29 03:10:25'),
(31, 'Barisal', '2011', '2020-06-29 03:10:31', '2020-06-29 03:10:31'),
(32, 'Barisal', '2010', '2020-06-29 03:10:38', '2020-06-29 03:10:38'),
(33, 'Barisal', '2009', '2020-06-29 03:10:43', '2020-06-29 03:10:43'),
(34, 'Barisal', '2008', '2020-06-29 03:10:56', '2020-06-29 03:10:56'),
(35, 'Chittagong', '2019', '2020-06-29 03:11:05', '2020-06-29 03:11:05'),
(36, 'Chittagong', '2018', '2020-06-29 03:11:23', '2020-06-29 03:11:23'),
(37, 'Chittagong', '2017', '2020-06-29 03:11:29', '2020-06-29 03:11:29'),
(38, 'Chittagong', '2016', '2020-06-29 03:11:35', '2020-06-29 03:11:35'),
(39, 'Chittagong', '2015', '2020-06-29 03:11:40', '2020-06-29 03:11:40'),
(40, 'Chittagong', '2014', '2020-06-29 03:11:46', '2020-06-29 03:11:46'),
(41, 'Chittagong', '2013', '2020-06-29 03:11:51', '2020-06-29 03:11:51'),
(42, 'Chittagong', '2012', '2020-06-29 03:11:56', '2020-06-29 03:11:56'),
(43, 'Chittagong', '2011', '2020-06-29 03:12:02', '2020-06-29 03:12:02'),
(44, 'Chittagong', '2010', '2020-06-29 03:12:09', '2020-06-29 03:12:09'),
(45, 'Chittagong', '2009', '2020-06-29 03:12:15', '2020-06-29 03:12:15'),
(46, 'Comilla', '2019', '2020-06-29 03:12:23', '2020-06-29 03:12:23'),
(47, 'Comilla', '2018', '2020-06-29 03:12:28', '2020-06-29 03:12:28'),
(48, 'Chittagong', '2017', '2020-06-29 03:12:33', '2020-06-29 03:12:33'),
(49, 'Comilla', '2016', '2020-06-29 03:12:39', '2020-06-29 03:12:39'),
(50, 'Comilla', '2015', '2020-06-29 03:12:43', '2020-06-29 03:12:43'),
(51, 'Comilla', '2014', '2020-06-29 03:12:49', '2020-06-29 03:12:49'),
(52, 'Comilla', '2013', '2020-06-29 03:12:55', '2020-06-29 03:12:55'),
(53, 'Comilla', '2012', '2020-06-29 03:13:02', '2020-06-29 03:13:02'),
(54, 'Comilla', '2011', '2020-06-29 03:13:08', '2020-06-29 03:13:08'),
(55, 'Comilla', '2010', '2020-06-29 03:13:14', '2020-06-29 03:13:14'),
(56, 'Comilla', '2009', '2020-06-29 03:13:20', '2020-06-29 03:13:20'),
(57, 'Dhaka', '2019', '2020-06-29 03:17:00', '2020-06-29 03:17:00'),
(58, 'Dhaka', '2018', '2020-06-29 03:17:06', '2020-06-29 03:17:06'),
(59, 'Dhaka', '2017', '2020-06-29 03:17:13', '2020-06-29 03:17:13'),
(60, 'Dhaka', '2016', '2020-06-29 03:17:18', '2020-06-29 03:17:18'),
(61, 'Dhaka', '2015', '2020-06-29 03:17:23', '2020-06-29 03:17:23'),
(62, 'Dhaka', '2014', '2020-06-29 03:17:32', '2020-06-29 03:17:32'),
(63, 'Dhaka', '2013', '2020-06-29 03:17:39', '2020-06-29 03:17:39'),
(64, 'Dhaka', '2012', '2020-06-29 03:17:45', '2020-06-29 03:17:45'),
(65, 'Dhaka', '2011', '2020-06-29 03:17:52', '2020-06-29 03:17:52'),
(66, 'Dhaka', '2010', '2020-06-29 03:17:57', '2020-06-29 03:17:57'),
(67, 'Dhaka', '2009', '2020-06-29 03:18:04', '2020-06-29 03:18:04'),
(68, 'Dinajpur', '2019', '2020-06-29 03:18:52', '2020-06-29 03:18:52'),
(69, 'Dinajpur', '2018', '2020-06-29 03:19:00', '2020-06-29 03:19:00'),
(70, 'Dinajpur', '2017', '2020-06-29 03:19:35', '2020-06-29 03:19:35'),
(71, 'Dinajpur', '2016', '2020-06-29 03:20:00', '2020-06-29 03:20:00'),
(72, 'Dinajpur', '2015', '2020-06-29 03:20:08', '2020-06-29 03:20:08'),
(73, 'Dinajpur', '2014', '2020-06-29 03:20:18', '2020-06-29 03:20:18'),
(74, 'Dinajpur', '2013', '2020-06-29 03:20:23', '2020-06-29 03:20:23'),
(75, 'Dinajpur', '2012', '2020-06-29 03:20:30', '2020-06-29 03:20:30'),
(76, 'Dinajpur', '2011', '2020-06-29 03:20:36', '2020-06-29 03:20:36'),
(77, 'Dinajpur', '2010', '2020-06-29 03:20:41', '2020-06-29 03:20:41'),
(78, 'Dinajpur', '2009', '2020-06-29 03:20:46', '2020-06-29 03:20:46'),
(79, 'Jessore', '2019', '2020-06-29 03:21:08', '2020-06-29 03:21:08'),
(80, 'Jessore', '2018', '2020-06-29 03:21:18', '2020-06-29 03:21:18'),
(81, 'Jessore', '2017', '2020-06-29 03:21:23', '2020-06-29 03:21:23'),
(82, 'Jessore', '2016', '2020-06-29 03:21:29', '2020-06-29 03:21:29'),
(83, 'Jessore', '2015', '2020-06-29 03:21:35', '2020-06-29 03:21:35'),
(84, 'Jessore', '2014', '2020-06-29 03:21:44', '2020-06-29 03:21:44'),
(85, 'Jessore', '2013', '2020-06-29 03:21:50', '2020-06-29 03:21:50'),
(86, 'Jessore', '2012', '2020-06-29 03:21:56', '2020-06-29 03:21:56'),
(87, 'Jessore', '2011', '2020-06-29 03:22:03', '2020-06-29 03:22:03'),
(88, 'Jessore', '2010', '2020-06-29 03:22:09', '2020-06-29 03:22:09'),
(89, 'Jessore', '2009', '2020-06-29 03:22:15', '2020-06-29 03:22:15'),
(90, 'Mymensingh', '2019', '2020-06-29 03:23:20', '2020-06-29 03:23:20'),
(91, 'Mymensingh', '2018', '2020-06-29 03:23:35', '2020-06-29 03:23:35'),
(92, 'Mymensingh', '2017', '2020-06-29 03:23:44', '2020-06-29 03:23:44'),
(93, 'Mymensingh', '2016', '2020-06-29 03:23:50', '2020-06-29 03:23:50'),
(94, 'Mymensingh', '2015', '2020-06-29 03:23:57', '2020-06-29 03:23:57'),
(95, 'Mymensingh', '2014', '2020-06-29 03:24:05', '2020-06-29 03:24:05'),
(96, 'Mymensingh', '2013', '2020-06-29 03:24:11', '2020-06-29 03:24:11'),
(97, 'Mymensingh', '2012', '2020-06-29 03:24:17', '2020-06-29 03:24:17'),
(98, 'Mymensingh', '2011', '2020-06-29 03:24:24', '2020-06-29 03:24:24'),
(99, 'Mymensingh', '2010', '2020-06-29 03:24:30', '2020-06-29 03:24:30'),
(100, 'Mymensingh', '2009', '2020-06-29 03:24:38', '2020-06-29 03:24:38'),
(101, 'Rajshahi', '2019', '2020-06-29 03:24:52', '2020-06-29 03:24:52'),
(102, 'Rajshahi', '2018', '2020-06-29 03:25:00', '2020-06-29 03:25:00'),
(103, 'Rajshahi', '2017', '2020-06-29 03:25:38', '2020-06-29 03:25:38'),
(104, 'Rajshahi', '2016', '2020-06-29 03:25:47', '2020-06-29 03:25:47'),
(105, 'Rajshahi', '2015', '2020-06-29 03:25:53', '2020-06-29 03:25:53'),
(106, 'Rajshahi', '2014', '2020-06-29 03:26:01', '2020-06-29 03:26:01'),
(107, 'Rajshahi', '2013', '2020-06-29 03:26:09', '2020-06-29 03:26:09'),
(108, 'Rajshahi', '2012', '2020-06-29 03:26:16', '2020-06-29 03:26:16'),
(109, 'Rajshahi', '2011', '2020-06-29 03:26:24', '2020-06-29 03:26:24'),
(110, 'Rajshahi', '2010', '2020-06-29 03:26:31', '2020-06-29 03:26:31'),
(111, 'Rajshahi', '2009', '2020-06-29 03:26:37', '2020-06-29 03:26:37'),
(112, 'Sylhet', '2019', '2020-06-29 03:27:05', '2020-06-29 03:27:05'),
(113, 'Sylhet', '2018', '2020-06-29 03:27:11', '2020-06-29 03:27:11'),
(114, 'Sylhet', '2017', '2020-06-29 03:27:17', '2020-06-29 03:27:17'),
(115, 'Sylhet', '2016', '2020-06-29 03:27:24', '2020-06-29 03:27:24'),
(116, 'Sylhet', '2015', '2020-06-29 03:27:30', '2020-06-29 03:27:30'),
(117, 'Sylhet', '2014', '2020-06-29 03:27:43', '2020-06-29 03:27:43'),
(118, 'Sylhet', '2013', '2020-06-29 03:27:52', '2020-06-29 03:27:52'),
(119, 'Sylhet', '2012', '2020-06-29 03:27:58', '2020-06-29 03:27:58'),
(120, 'Sylhet', '2011', '2020-06-29 03:28:05', '2020-06-29 03:28:05'),
(121, 'Sylhet', '2010', '2020-06-29 03:28:11', '2020-06-29 03:28:11'),
(122, 'Sylhet', '2009', '2020-06-29 03:28:16', '2020-06-29 03:28:16'),
(123, 'Madrasah', '2019', '2020-06-29 03:29:29', '2020-06-29 03:29:29'),
(124, 'Madrasah', '2018', '2020-06-29 03:29:35', '2020-06-29 03:29:35'),
(125, 'Madrasah', '2017', '2020-06-29 03:29:41', '2020-06-29 03:29:41'),
(126, 'Madrasah', '2016', '2020-06-29 03:29:47', '2020-06-29 03:29:47'),
(127, 'Madrasah', '2015', '2020-06-29 03:29:55', '2020-06-29 03:29:55'),
(128, 'Madrasah', '2014', '2020-06-29 03:30:04', '2020-06-29 03:30:04'),
(129, 'Madrasah', '2013', '2020-06-29 03:30:11', '2020-06-29 03:30:11'),
(130, 'Madrasah', '2012', '2020-06-29 03:30:19', '2020-06-29 03:30:19'),
(131, 'Madrasah', '2011', '2020-06-29 03:30:25', '2020-06-29 03:30:25'),
(132, 'Madrasah', '2010', '2020-06-29 03:30:31', '2020-06-29 03:30:31'),
(133, 'Madrasah', '2009', '2020-06-29 03:30:38', '2020-06-29 03:30:38'),
(134, 'Comilla', '2017', '2020-06-29 03:37:40', '2020-06-29 03:37:40');

-- --------------------------------------------------------

--
-- Table structure for table `chapters`
--

CREATE TABLE `chapters` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `chapter_name` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `chapters`
--

INSERT INTO `chapters` (`id`, `chapter_name`, `created_at`, `updated_at`) VALUES
(2, 'তথ্য ও যোগাযোগ প্রযুক্তি', '2020-05-17 07:11:56', '2020-05-22 09:42:51'),
(3, 'সংখ্যা পদ্ধতি', '2020-06-08 23:27:33', '2020-06-08 23:27:33'),
(7, 'ডেটাবেজ ম্যানেজমেন্ট সিস্টেম', '2020-06-29 02:54:50', '2020-06-29 02:54:50'),
(8, 'প্রোগ্রামিং ভাষা', '2020-06-29 09:27:20', '2020-06-29 09:27:20'),
(9, 'ওয়েব ডিজাইন এবং HTML', '2020-06-30 06:26:29', '2020-06-30 06:26:29'),
(11, 'ডিজিটাল ডিভাইস', '2020-07-02 03:12:27', '2020-07-02 03:12:27'),
(12, 'কমিউনিকেশন সিস্টেম ও নেটওয়ার্কিং', '2020-07-02 09:06:59', '2020-07-02 09:06:59');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2020_03_30_142840_create_chapters_table', 1),
(2, '2020_03_30_142925_create_topics_table', 1),
(3, '2020_03_30_144806_create_questions_table', 1),
(4, '2020_03_31_180159_create_board_lists_table', 1),
(5, '2020_04_11_082642_create_results_table', 1),
(6, '2020_02_03_110703_create_users_table', 2);

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `topic_id` bigint(20) UNSIGNED NOT NULL,
  `question` varchar(400) NOT NULL,
  `board_id` int(11) DEFAULT NULL,
  `option1` varchar(255) NOT NULL,
  `option2` varchar(255) NOT NULL,
  `option3` varchar(255) NOT NULL,
  `option4` varchar(255) NOT NULL,
  `correct_option` varchar(255) NOT NULL,
  `tag` varchar(255) DEFAULT NULL,
  `details` varchar(500) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `topic_id`, `question`, `board_id`, `option1`, `option2`, `option3`, `option4`, `correct_option`, `tag`, `details`, `created_at`, `updated_at`) VALUES
(13, 2, 'তথ্য ও যোগাযোগ প্রযুক্তির বিকাশে কোনটির অবদান সবচেয়ে বেশি?', NULL, 'রেডিও', 'টেলিফোন', 'টেলিভিশন', 'কম্পিউটার', '4', NULL, NULL, '2020-05-17 07:18:13', '2020-05-17 07:18:13'),
(14, 2, 'টেলিযোগাযোগের মাধ্যমে সভা করাকে কী বলা হয়?', NULL, 'টেলিকনফারেন্স', 'টেলিকমিউনিকশেন', 'ভিডিও কনফারেন্স', 'ভিডিও চ্যাটিং', '1', NULL, NULL, '2020-05-18 17:15:51', '2020-05-18 17:15:51'),
(15, 2, 'রোগী দূরের ডাক্তারের কাছে থেকে সেবা পেতে পারে কোনটির মাধ্যমে?', NULL, 'ভিডিও কনফারেন্স', 'অনলাইন চ্যাটিং', 'টেলিকনফারেন্স', 'ভয়েস কল', '1', NULL, NULL, '2020-05-18 17:17:07', '2020-05-18 17:17:07'),
(16, 2, 'সাম্প্রতিক সময়ে কোনটির ব্যাপক প্রসার হয়েছে?', NULL, 'টেলিভিশন', 'ইন্টারনেট', 'কম্পিউটার', 'মোবাইল', '2', NULL, NULL, '2020-05-18 17:18:28', '2020-07-01 10:32:04'),
(17, 2, 'তথ্য প্রযুক্তি বলতে মূলত কী বুঝায়?', NULL, 'তথ্য রাখা ও ব্যবহার করার প্রযুক্তি', 'তথ্য বিক্রির প্রযুক্তি', 'তথ্য বিকৃতির প্রযুক্তি', 'শুধুমাত্র তথ্য সংরক্ষণ করার প্রযুক্তি', '1', NULL, NULL, '2020-05-18 17:19:24', '2020-05-18 17:19:24'),
(18, 2, 'স্কাইপি বলতে কী বুঝায়?', NULL, 'ইলেকট্রনিক্স গুডস', 'ভিডিও চ্যাটিং ব্যবস্থার মাধ্যম', 'রেডিও স্টেশন', 'স্পেইস স্টেশন', '2', NULL, NULL, '2020-05-18 17:20:17', '2020-05-18 17:20:17'),
(19, 2, 'বর্তমান সময়ের আধুনিক সকল যোগাযোগ ও সম্প্রচার ব্যবস্থাই মূলত কী নির্ভর?', NULL, 'স্যাটেলাইট', 'রেডিও', 'টেলিভিশন', 'দৈনিক পত্রিকা', '1', NULL, NULL, '2020-05-18 17:21:12', '2020-07-01 10:32:29'),
(20, 2, 'টেলিভিশন একটি?', NULL, 'প্রেরক যন্ত্র', 'একমুখী যোগাযোগ ব্যবস্থা', 'দ্বিমুখী যোগাযোগ ব্যবস্থা', 'টেলিকমিউনিকেশন', '2', NULL, NULL, '2020-05-18 17:22:20', '2020-05-22 06:50:35'),
(21, 2, 'কোন প্রযুক্তি ব্যবহার করে ভিন্ন স্থানে থেকেও মিটিং এর কাজ সম্পন্ন করা যায়?', NULL, 'ই-মেইল', 'ফেইসবুক', 'টেলিকনফারেন্সিং', 'টুইটার', '3', NULL, NULL, '2020-05-18 17:23:27', '2020-05-18 17:23:27'),
(22, 2, 'কোনটি আবিষ্কারের ফলে যোগাযোগ ব্যবস্থার প্রভূত উন্নতি হয়?', NULL, 'কম্পিউটার', 'টেলিফোন', 'প্রিন্টার', 'টেলিগ্রাফ', '1', NULL, NULL, '2020-05-18 17:24:08', '2020-05-22 08:12:00'),
(27, 2, 'তথ্য ও যোগাযোগ প্রযুক্তি', 1, 'অপচয় কমায়', 'শারীরিক শ্রম বাড়ায়', 'ব্যয় বৃদ্ধি পায়', 'মানুষের মেধা ব্যবহার কমায়', '1', NULL, NULL, '2020-05-22 08:55:27', '2020-05-22 08:55:27'),
(35, 4, 'বিশ্বগ্রাম ধারণার প্রবক্তা কে?', 4, 'মার্শাল ম্যাকলুহান', 'টিম বানারসলী', 'মার্ক জুকার বার্গ', 'ই এফ কড', '1', NULL, NULL, '2020-05-22 09:52:05', '2020-05-22 09:52:05'),
(36, 4, 'ইন্টারনেটের মাধ্যমে ঘরে বসে কর্মসংস্থানের সুযোগকে কি বলা হয়?', NULL, 'ই-কমার্স', 'ই-মার্কেটিং', 'ই-বিজনেস', 'আউটসোর্সিং', '4', NULL, NULL, '2020-05-22 10:02:38', '2020-05-22 10:02:38'),
(37, 4, 'ইন্টারনেটের মাধ্যমে ঘরে বসে কর্মসংস্থানের সুযোগকে কি বলা হয়?', NULL, 'ই-কমার্স', 'ই-মার্কেটিং', 'ই-বিজনেস', 'আউটসোর্সিং', '4', NULL, NULL, '2020-05-23 08:48:51', '2020-05-23 08:48:51'),
(38, 4, 'ফ্রিল্যান্সিং কী?', NULL, 'দীর্ঘ মেয়াদি চুক্তিতে কাজ করা', 'নিয়ম মাফিক ১০টা-৫টা অফিস করা', 'স্বাধীনভাবে যে কোনো ব্যক্তি বা প্রতিষ্ঠানে কাজ করা', 'সুনির্দিষ্ট কাজের লাইসেন্স নিয়ে কাজ করা', '3', NULL, NULL, '2020-05-23 10:21:30', '2020-05-23 10:21:30'),
(39, 4, 'গ্লোবাল ভিলেজ প্রতিষ্ঠার ক্ষেত্রে নিচের কোন উপাদানটির ভূমিকা সবচেয়ে বেশি?', NULL, 'ইন্টারনেট', 'রেডিও', 'টেলিভিশন', 'টেলিফোন', '1', NULL, NULL, '2020-05-23 10:22:55', '2020-05-23 10:22:55'),
(40, 4, 'বিশ্বগ্রাম ধারণার সাথে কোন বিষয়টি বিশেষভাবে সম্পৃক্ত?', 3, 'গ্রামের সাথে শহরের সহজ যোগাযোগ', 'ইন্টারনেট সুবিধার ব্যাপক প্রসার', 'বিশ্বব্যাপী গ্রামকে নগরে পরিবর্তন', 'শিক্ষার অবাধ সুযোগ সুবিধার বিস্তার', '2', NULL, NULL, '2020-05-23 10:23:52', '2020-05-23 10:23:52'),
(41, 4, 'কোনো বিজ্ঞাপন বিশ্বব্যাপী ছড়িয়ে দিতে হলে কী করতে হবে?', NULL, 'সাইনবোর্ডে টাঙাতে হবে', 'পত্রিকায় দিতে হবে', 'ওয়েবসাইটে দিতে হবে', 'রেডিওতে প্রচার করতে হবে', '3', NULL, NULL, '2020-05-23 10:24:54', '2020-05-23 10:24:54'),
(42, 4, 'হারবার্ট মার্শাল ম্যাকলুহান নিচের কোন দেশটির অধিবাসী ছিলেন?', NULL, 'জার্মানি', 'ফ্রান্স', 'গ্রিস', 'কানাডা', '4', NULL, NULL, '2020-05-23 10:25:45', '2020-05-23 10:25:45'),
(43, 4, 'বিশ্বগ্রামের মেরুদণ্ড কোনটি?', 5, 'হার্ডওয়্যার', 'সফটওয়্যার', 'কানেকটিভিটি', 'ডেটা', '3', NULL, NULL, '2020-05-23 10:53:40', '2020-05-23 10:53:40'),
(44, 4, 'কোনটির মাধ্যমে এক দেশের লোক অন্য দেশের লোকের সাথে ভিডিও চ্যাট করেন?', NULL, 'স্কাইপি', 'মাই স্পেস', 'টুইটার', 'ইউটিউব', '1', NULL, NULL, '2020-05-23 10:56:02', '2020-05-23 10:56:02'),
(45, 4, 'অনলাইনের মাধ্যমে ব্যবসায়-বাণিজ্য করাকে বলা হয়', NULL, 'ই-মেইল', 'ই-বুক', 'ই-গভর্নেস', 'ই-কমার্স', '4', NULL, NULL, '2020-05-23 10:56:55', '2020-05-23 10:56:55'),
(46, 4, 'আউটসোর্সিং কী?', 3, 'নির্দিষ্ট শ্রম ঘণ্টায় কাজ করা', 'ইন্টারনেটভিত্তিক কাজ', 'বিশেষ ব্রাউজিং সুবিধা', 'বিশ্বব্যাপী নেটওয়ার্ক ব্যবস্থা', '2', NULL, NULL, '2020-05-23 10:58:41', '2020-05-23 10:58:41'),
(47, 4, 'কোনটির কল্যাণে ঘরে বসেই বিশ্বকে হাতের মুঠোয় পাওয়া যাচ্ছে?', NULL, 'ইন্টারনেট', 'টেলিভিশন', 'টেলিফোন', 'মোবাইল ফোন', '1', NULL, NULL, '2020-05-23 11:00:33', '2020-05-23 11:00:33'),
(48, 4, 'দূরবর্তী কোনো ব্যক্তির সাথে যোগাযোগের সময় কোনটি থাকা প্রয়োজন হয়?', NULL, 'ইন্টারনেট', 'ক্রায়োসার্জারি', 'গ্লোবাল ভিলেজ', 'ভার্চুয়াল রিয়েলিটি', '1', NULL, NULL, '2020-05-23 11:01:56', '2020-05-23 11:01:56'),
(49, 4, 'দেশের অর্থনীতির চাকাকে বেগবান করার ক্ষেত্রে নিচের কোনটি নতুন মাত্রা যুক্ত করেছে?', NULL, 'ফেইসবুক', 'আউটসোর্সিং', 'গুগল', 'সংবাদপত্র', '2', NULL, NULL, '2020-05-23 11:02:41', '2020-05-23 11:02:41'),
(50, 4, 'অর্থ প্রেরণ ও গ্রহণের ক্ষেত্রে নিচের কোনটি নির্ভরযোগ্য মাধ্যমে পরিণত হয়েছে?', NULL, 'মোবাইল ব্যাংকিং', 'কুরিয়ার সার্ভিস', 'তফসিলি ব্যাংক', 'পোস্ট অফিস', '1', NULL, NULL, '2020-05-23 11:26:32', '2020-05-23 11:26:32'),
(51, 4, 'ই-কমার্স এর অন্তর্ভুক্ত নয়', 6, 'বিপণন', 'সরবরাহ', 'লেনদেন', 'প্রচার', '3', NULL, NULL, '2020-05-23 11:27:36', '2020-05-23 11:27:36'),
(52, 4, 'প্লেজিয়ারিজম কোন অপরাধের সাথে জড়িত', 7, 'অন্যের লেখা চুরি', 'সফটওয়্যার পাইরেসি', 'কপিরাইট লংঘন', 'আইডেন্টিটি চুরি', '1', NULL, NULL, '2020-05-23 11:28:54', '2020-05-23 11:28:54'),
(53, 4, 'অনুমতি ব্যতীত কোনো কম্পিউটার নেটওয়ার্কে প্রবেশ করে কম্পিউটার ব্যবহার করাকে কি বলে?', 5, 'সফটওয়্যার পাইরেসি', 'ন্যানো টেকনোলজি', 'প্লেজিয়ারিজম', 'হ্যাকিং', '4', NULL, NULL, '2020-05-23 11:29:45', '2020-05-23 11:29:45'),
(54, 4, 'কোনটি আউটসোর্সিং-এর মার্কেট প্লেস?', 8, 'টুইটার', 'মাইস্পেস', 'ওডেক্স', 'ডিগ', '3', NULL, NULL, '2020-05-23 11:30:58', '2020-05-23 11:30:58'),
(55, 4, 'ইন্টারনেটের মাধ্যমে ব্যবসায় পরিচালনা করাকে কী বলে?', 9, 'ই-মেইল', 'ই-কমার্স', 'ই-ট্রেড', 'ই-গভর্নেন্স', '2', NULL, NULL, '2020-05-23 11:33:07', '2020-05-23 11:33:07'),
(56, 4, 'ইন্টারনেট ব্যবহার করে কর্মসংস্থানের সুযোগকে কী বলা হয়?', 10, 'ই-কমার্স', 'আউটসোর্সিং', 'ই-জিনেস', 'ই-গভর্নেন্স', '2', NULL, NULL, '2020-05-23 11:34:50', '2020-05-23 11:34:50'),
(57, 6, 'খৃষ্টপূর্ব কত বছর পূর্বে সর্বপ্রথম গণনার কাজ হয় শুরু?', NULL, '১০০০', '২৪০০', '৩৪০০', '৫৪০০', '3', NULL, NULL, '2020-06-09 03:00:46', '2020-06-09 03:00:46'),
(74, 7, 'বাস্তব নয়, কিন্তু বাস্তবের চেতনা উদ্রেককারী বিজ্ঞাননির্ভর কল্পনাকে কী বলে?', NULL, 'ভার্চুয়াল রিয়েলিটি', 'ভার্চুয়াল ফাংশন', 'ভার্চুয়াল পাস্ট', 'ভার্চুয়ালিটি', '1', NULL, NULL, '2020-06-09 14:50:34', '2020-06-09 14:50:34'),
(77, 7, 'কোন তত্ত্বের উপর ভার্চুয়াল রিয়েলিটি প্রতিষ্ঠিত?', NULL, 'মরগান তত্ত্ব', 'সিমুলেশন তত্ত্ব', 'কম্পিউটার তত্ত্ব', 'ভার্চুয়াল তত্ত্ব', '1', NULL, NULL, '2020-06-09 14:56:52', '2020-06-09 14:56:52'),
(78, 7, 'ভার্চুয়াল রিয়েলিটির বৈশিষ্ট্য কোনটি?', 14, 'তথ্য আদান-প্রদান', 'বাস্তব জগতে বিচরণ', 'দ্বিমাত্রিক জগতে প্রবেশ', 'কাল্পনিক জগতে বিচরণ', '4', NULL, NULL, '2020-06-09 14:58:20', '2020-06-09 14:58:20'),
(79, 7, 'সাধারণভাবে ভার্চুয়াল রিয়েলিটির পরিবেশ হলো -', 4, 'একমাত্রিক', 'দ্বি-মাত্রিক', 'ত্রি-মাত্রিক', 'চতুর্মাত্রিক', '3', NULL, NULL, '2020-06-09 15:04:31', '2020-06-09 15:04:31'),
(80, 7, 'সাধারণভাবে ভার্চুয়াল রিয়েলিটির পরিবেশ হলো -', 6, 'একমাত্রিক', 'দ্বি-মাত্রিক', 'ত্রি-মাত্রিক', 'চতুর্মাত্রিক', '3', NULL, NULL, '2020-06-09 15:04:31', '2020-06-09 15:04:31'),
(81, 7, 'কম্পিউটার সিমুলেশন প্রয়োগের ক্ষেত্র কোনটি?', 10, '. ক্রায়োসার্জারি', 'ভার্চুয়াল রিয়েলিটি', 'ইন্টারনেট', 'ভিডিও কনফারেন্সিং', '2', NULL, NULL, '2020-06-09 15:05:42', '2020-06-09 15:05:42'),
(82, 7, 'কোনটি ভার্চুয়াল রিয়েলিটিতে ব্যবহৃত হয়?', 15, 'ত্রিমাত্রিক সিমুলেশন', 'দ্বিমাত্রিক সিমুলেশন', 'হ্যান্ড জিওমেট্রি', 'বায়োলজিক্যাল ডেটা', '1', NULL, NULL, '2020-06-09 15:07:58', '2020-06-09 15:07:58'),
(83, 7, 'সিমুলেশনে যখন কোনো কিছুর শারীরিক উপস্থিতির আবহ প্রদান করা হয় তখন তাকে কী বলে?', NULL, 'ভার্চুয়াল ভিলেজ', 'ভার্চুয়াল হাউজ', 'ভার্চুয়াল সোসাইটি', 'ভার্চুয়াল রিয়েলিটি', '4', NULL, NULL, '2020-06-09 15:08:58', '2020-06-09 15:08:58'),
(84, 7, 'নিচের কোনটি ভার্চুয়াল রিয়েলিটি তৈরি করে?', NULL, 'বাস্তবভাবে কৃত্রিম জগৎ', 'কৃত্রিমভাবে বাস্তব জগৎ', 'বাস্তবভাবে কাল্পনিক জগৎ', 'কাল্পনিকভাবে কৃত্রিম জগৎ', '2', NULL, NULL, '2020-06-09 15:10:17', '2020-06-09 15:10:17'),
(85, 7, 'ভার্চুয়াল রিয়েলিটিতে ছবিগুলোকে জীবন্ত দেখানোর জন্য কোন প্রযুক্তি ব্যবহার করা হয়?', NULL, 'ত্রিমাত্রিক', 'দ্বিমাত্রিক', 'একমাত্রিক', 'চতুর্মাত্রিক', '1', NULL, NULL, '2020-06-09 15:11:06', '2020-06-09 15:11:06'),
(86, 7, 'ভার্চুয়াল রিয়েলিটির সাহায্যে সামরিক প্রশিক্ষণের সময় -', NULL, 'প্রাণহানির আশঙ্কা কমে যায়', 'প্রাণহানির কোনো আশঙ্কা থাকে না', 'প্রাণহানির আশঙ্কা বৃদ্ধি পায়', 'প্রাণহানি হওয়া-না হওয়ার আশঙ্কা সমান', '2', NULL, NULL, '2020-06-09 15:12:37', '2020-06-09 15:12:37'),
(87, 6, 'শূন্য এর উদ্ভব কোন সংখ্যা পদ্ধতি থেকে?', NULL, 'গ্রীক', 'হিন্দু', 'রোমান', 'চাইনিজ', '2', NULL, NULL, '2020-06-10 03:33:14', '2020-06-10 03:33:14'),
(88, 6, 'গণনার কাজের জন্য প্রথম কোন সংখ্যা পদ্ধতি ব্যবহার করা হয়?', NULL, 'ঊঁৎড়ঢ়বধহ', 'ঊমুঢ়ঃরধহ ঐরবৎড়মষুঢ়যরপ', 'উবাধহধমধৎর', 'অৎধনরপ', '2', NULL, NULL, '2020-06-10 03:34:58', '2020-06-10 03:34:58'),
(89, 6, 'মিশরীয় শিলালিপিতে কোন চিহ্ন দ্বারা ১০ সংখ্যাটি প্রকাশ করা হতো?', NULL, 'ঊঁৎড়ঢ়বধহ', 'ঊমুঢ়ঃরধহ ঐরবৎড়মষুঢ়যরপ', 'উবাধহধমধৎর', 'অৎধনরপ', '2', NULL, NULL, '2020-06-10 03:38:58', '2020-06-10 03:38:58'),
(90, 6, 'দশভিত্তিক এবং শূন্য এর প্রবক্তা কারা?', NULL, 'আরবীয়রা', 'মিশরীয়রা', 'ভারতীয়রা', 'ইউরোপীয়রা', '1', NULL, NULL, '2020-06-10 03:40:11', '2020-06-10 03:40:11'),
(91, 6, 'ঋণাত্মক সংখ্যা ব্যবহার সর্বপ্রথম কখন শুরু হয়?', NULL, '৩০০ সালে', '৪০০ সালে', '৫০০ সালে', '৬০০ সালে', '4', NULL, NULL, '2020-06-10 03:42:08', '2020-06-10 03:42:08'),
(92, 6, 'প্রাচীনকালের মানুষ সংখ্যার কাজ করত কীভাবে?', NULL, 'ক. কাঠের তৈরি যন্ত্রের সাহায্যে', 'গণনাযন্ত্রের সাহায্যে', 'হাতের আঙুলের সাহায্যে', 'কম্পিউটারের সাহায্যে', '3', NULL, NULL, '2020-06-10 03:44:46', '2020-06-10 03:44:46'),
(93, 6, 'প্রাচীন ব্যাবিলনের মানুষ গণনার জন্য কয় ধরনের পদ্ধতি ব্যবহার করত?', NULL, 'ক. ১ ধরনের পদ্ধতি', '২ ধরনের পদ্ধতি', '৩ ধরনের পদ্ধতি', '৪ ধরনের পদ্ধতি', '2', NULL, NULL, '2020-06-10 03:46:33', '2020-06-10 03:46:33'),
(94, 6, 'প্রাচীন ব্যাবিলনের মানুষ গণনার জন্য কয় ধরনের পদ্ধতি ব্যবহার করত?', NULL, '১ ধরনের পদ্ধতি', '২ ধরনের পদ্ধতি', '৩ ধরনের পদ্ধতি', '৪ ধরনের পদ্ধতি', '2', NULL, NULL, '2020-06-10 05:07:43', '2020-06-10 05:07:43'),
(95, 6, 'প্রাচীন ব্যাবিলনের মানুষ বড় সংখ্যা প্রকাশের জন্য কত ভিত্তিক সংখ্যা ব্যবহার করত?', NULL, '২ ভিত্তিক', '৮ ভিত্তিক', '২০ ভিত্তিক', '৬০ ভিত্তিক', '4', NULL, NULL, '2020-06-10 05:11:22', '2020-06-10 05:11:22'),
(96, 6, 'আরবরা কাদের কাছ থেকে গণনা পদ্ধতি আয়ত্ত করেছিলেন?', NULL, 'চীনাদের কাছ থেকে', 'গ্রীকদের কাছ থেকে', 'ভারতীয়দের কাছ থেকে', 'মিশরীয়দের কাছ থেকে', '3', NULL, NULL, '2020-06-10 05:26:52', '2020-06-10 05:26:52'),
(97, 6, 'খৃষ্টপূর্ব ৪০০ সালে গ্রিসে কয়টি গ্রিক অ্যালফাবেট নিয়ে ১০ভিত্তিক সংখ্যা পদ্ধতি চালু হয়?', NULL, '২০টি', '২৩টি', '২৭টি', '৩০টি', '3', NULL, NULL, '2020-06-10 07:01:46', '2020-06-10 07:01:46'),
(98, 6, 'কোন ভারতীয় গণিতবিদ শূন্য (“০”) আবিষ্কারের মাধ্যমে প্রথম বাইনারি সংখ্যা পদ্ধতির ধারণা দেন?', NULL, 'পিংগালা', 'জন ভন নিউম্যান', 'চার্লস ব্যাবেজ', 'লেডি এডা', '1', NULL, NULL, '2020-06-10 07:06:37', '2020-06-10 07:06:37'),
(99, 6, 'ভারতীয়দের কাছ থেকে আরবরা সংখ্যা পদ্ধতি আয়ত্ত করে কত খৃষ্টাব্দে?', NULL, '৪২০ খ্রিষ্টাব্দে', '৫১০ খ্রিষ্টাব্দে', '৫০০ খ্রিষ্টাব্দে', '৬০০ খ্রিষ্টাব্দে', '3', NULL, NULL, '2020-06-10 07:07:58', '2020-07-01 11:43:35'),
(100, 6, 'কোন বিজ্ঞানী ১০ ভিত্তিক সংখ্যা পদ্ধতির ওপর বই রচনা করেন?', NULL, 'আল বিরুনী', 'আল জাবির', 'আল খোয়ারিজমি', 'আল হ্যাজেন', '3', NULL, NULL, '2020-06-10 07:08:47', '2020-06-10 07:08:47'),
(102, 6, '০ (শূন্য) এর ব্যবহার ছিল না কোন সংখ্যা পদ্ধতিতে?', NULL, 'রোমান ও ইউরোপীয়দের সংখ্যা পদ্ধতিতে', 'ভারতীয় ও আরবীয়দের সংখ্যা পদ্ধতিতে', 'ভারতীয় উপমহাদেশে', 'আরবীয়দের সংখ্যা পদ্ধতিতে', '1', NULL, NULL, '2020-06-10 07:11:09', '2020-06-10 07:11:09'),
(103, 6, 'কোন সংখ্যা পদ্ধতিকে ইন্দো-আরবীয় সংখ্যা পদ্ধতি বলা হয়?', NULL, 'বাইনারি', 'দশমিক', 'অক্টাল', 'হেক্সাডেসিম্যাল', '2', NULL, NULL, '2020-06-10 07:12:23', '2020-06-10 07:12:23'),
(104, 8, 'সংখ্যা প্রকাশ করার পদ্ধতিকে বলে-', NULL, 'অংক', 'সংখ্যা', 'সংখ্যা পদ্ধতি', 'স্থানীয় মান', '3', NULL, NULL, '2020-06-10 07:21:46', '2020-07-01 11:46:16'),
(105, 8, 'সংখ্যা পদ্ধতির ক্ষুদ্রতম প্রতীক কোনটি', NULL, 'অঙ্ক', 'সংখ্যা', 'গণিত', 'বিষয়', '1', NULL, NULL, '2020-06-10 07:23:15', '2020-06-10 07:23:15'),
(106, 8, 'মেমরি পরিমাপের ক্ষুদ্রতম একক কী?', NULL, 'বিট', 'বাইট', 'কিলোবাইট', 'মেগা বাইট', '1', NULL, NULL, '2020-06-10 07:25:22', '2020-06-10 07:25:22'),
(107, 8, '১ বাইটের অর্ধেককে কী বলা হয়?', NULL, 'বিট', 'অর্ধ-বাইট', 'নিবল', 'অক্ষর', '3', NULL, NULL, '2020-06-10 07:27:19', '2020-06-10 07:27:19'),
(108, 8, '০ এবং ১-এ অঙ্ক দুইটির প্রত্যেকটিকে কী বলা হয়?', NULL, 'বিট', 'ডিজিট', 'বাইনারি', 'সংখ্যা', '1', NULL, NULL, '2020-06-10 07:28:30', '2020-06-10 07:28:30'),
(109, 8, 'বিট কী ধরনের একক?', NULL, 'মৌলিক', 'যৌগিক', 'সহমৌলিক', 'সহযৌগিক', '1', NULL, NULL, '2020-06-10 07:29:34', '2020-06-10 07:29:34'),
(110, 8, 'কোন সংখ্যা পদ্ধতির ভিত্তি হল -', NULL, 'ব্যবহৃত মৌলিক চিহ্নের মোট সংখ্যা', 'সর্বোচ্চ ডিজিট', 'সর্বনি¤œ ডিজিট', 'ডিজিটসমূহের গড়', '1', NULL, NULL, '2020-06-10 07:32:22', '2020-06-11 09:04:08'),
(111, 9, 'কম্পিউটার অভ্যন্তরীণ কাজ করার জন্য কোন সংখ্যা পদ্ধতি ব্যবহার করে?', NULL, 'বাইনারি', 'দশমিক', 'অক্টাল', '. হেক্সাডেসিমাল', '1', NULL, NULL, '2020-06-10 07:34:56', '2020-06-10 07:34:56'),
(112, 10, 'সংখ্যা পদ্ধতিকে প্রধানত কয় ভাগ করা যায়?', 5, '২', '৩', '৮', '১', '1', NULL, NULL, '2020-06-10 07:42:30', '2020-06-10 07:42:30'),
(113, 10, 'ভিত্তি এর উপর নির্ভর করে সংখ্যা পদ্ধতি কত প্রকার?', 17, '২', '৪', '৮', '১০', '2', NULL, NULL, '2020-06-10 08:05:26', '2020-06-10 08:05:26'),
(114, 10, 'কোনটি অবস্থানগত সংখ্যা পদ্ধতি নয়?', NULL, 'বাইনারি', 'ষোড়শ', 'অষ্টক', 'মিশরীয় হরফ পদ্ধতি', '4', NULL, NULL, '2020-06-10 08:08:12', '2020-06-10 08:08:12'),
(115, 10, 'নিচের কোন সংখ্যা পদ্ধতিটি নন পজিশনাল সংখ্যা পদ্ধতি?', NULL, 'বাইনারি', 'ডেসিমাল', 'রোমান', 'অক্টাল', '3', NULL, NULL, '2020-06-10 08:19:50', '2020-07-01 12:37:58'),
(116, 10, 'পজিশনাল সংখ্যা পদ্ধতি কত প্রকার?', NULL, '২', '৩', '৪ প্রকার', '৫ প্রকার', '3', NULL, NULL, '2020-06-10 08:24:18', '2020-06-10 08:24:18'),
(117, 9, 'দশমিক সংখ্যা ৯১ এর বাইনারি রূপ কোনটি?', 16, '১০১১০১১', '১১০১০১০', '১১১০০১১', '১১০১১০১', '1', NULL, NULL, '2020-06-10 08:26:29', '2020-06-10 08:26:29'),
(118, 9, '(১২)১০ এর সমকক্ষ বাইনারি কোনটি?', 5, '(১১০১)২', '(১১০০)২', '(১১১১)২', '(১০১০)২', '2', NULL, NULL, '2020-06-10 08:28:07', '2020-06-10 08:28:07'),
(119, 9, '১০১১ এর পরবর্তী বাইনারি সংখ্যা কত?', NULL, '১০১০', '১১০০', '১১০১', '১১১০', '2', NULL, NULL, '2020-06-10 08:29:18', '2020-06-10 08:29:18'),
(120, 9, '(০.৮৭৫)১০ এর সমতুল্য বাইনারি সংখ্যা', NULL, '(০.১১১)২', '(০.১১০১)২', '(০.০১১)২', '(০.০১১১)২', '1', NULL, NULL, '2020-06-10 08:35:36', '2020-06-10 08:35:36'),
(121, 9, '(৩৭.১২৫)১০ এর বাইনারি মান কত?', 18, '১০০১০১.০১', '১০০১০১.০০১', '১০১০০১.০১', '১০১০০১.০০১', '2', NULL, NULL, '2020-06-10 08:37:12', '2020-06-10 08:37:12'),
(122, 9, 'বাইনারি সংখ্যা পদ্ধতির প্রতীক দুটি কী কী?', NULL, '১ এবং ১', '০ এবং ১', '০ এবং ০', '২ এবং ১', '2', NULL, NULL, '2020-06-10 08:38:22', '2020-06-10 08:38:22'),
(123, 11, 'কৃত্রিম উপায়ে মানুষের চিন্তা-ভাবনাগুলো কম্পিউটারের মধ্যে রূপ দেয়াকে কী বলে?', NULL, 'কৃত্রিম ভাবনা', 'কৃত্রিম বুদ্ধিমত্তা', 'কৃত্রিম প্রোগ্রাম', 'কৃত্রিম তথ্য', '2', NULL, NULL, '2020-06-10 08:46:45', '2020-06-10 08:46:45'),
(124, 11, 'কৃত্রিম বুদ্ধিমত্তা সংযোজন করা হয়েছে কোন প্রজন্মের কম্পিউটারে?', NULL, 'পঞ্চম', 'চতুর্থ', 'তৃতীয়', 'ষষ্ঠ', '1', NULL, NULL, '2020-06-10 08:47:38', '2020-06-10 08:47:38'),
(125, 11, 'কৃত্রিম বুদ্ধিমত্তা প্রধানত কোথায় ব্যবহৃত হয়?', 11, 'বায়োমেট্রিক্স', 'বায়োইনফরমেটিক্স', 'রোবোটিক্স', 'ন্যানো টেকনোলজি', '3', NULL, NULL, '2020-06-10 08:57:44', '2020-06-10 08:57:44'),
(126, 9, 'কোন সংখ্যা পদ্ধতির অপর নাম বুলিয়ান অ্যালজেবরা?', NULL, 'বাইনারি', 'অকটাল', 'দশমিক', 'হেক্সাডেসিম্যাল', '1', NULL, NULL, '2020-06-10 08:59:21', '2020-06-10 08:59:21'),
(127, 9, 'বাইনারি সংখ্যা পদ্ধতির প্রথম ধারণা দেন?', NULL, 'গটফ্রিজ লিবনিজ', 'আল জাবির', '. আল খোয়ারিজমি', '. আল হ্যাজেন', '1', NULL, NULL, '2020-06-10 09:03:20', '2020-07-01 12:49:47'),
(128, 9, 'কম্পিউটার মেশিন ল্যাঙ্গুয়েজ গঠিত হয় কতটি বিদ্যুৎ প্রবাহের সমন্বয়ে?', NULL, 'একটি মাত্র সংকেতের সমন্বয়ে', 'দুটি মাত্র সংকেতের সমন্বয়ে', 'তিনটি মাত্র সংকেতের সমন্বয়ে', 'চারটি মাত্র সংকেতের সমন্বয়ে', '2', NULL, NULL, '2020-06-10 09:05:24', '2020-07-01 12:31:17'),
(129, 9, '(১০১০১০)২ সংখ্যাটিতে সর্ববামের ১ নির্দেশ করে কোনটি?', NULL, 'খঝই', 'গঝই', 'খঝউ', '. গঝউ', '2', NULL, NULL, '2020-06-10 09:07:28', '2020-06-10 09:07:28'),
(131, 9, 'অক্ট্যাল সংখ্যার বেজ কত?', NULL, '২', '৮', '. ১০', '১৬', '2', NULL, NULL, '2020-06-10 09:11:22', '2020-07-01 11:54:48'),
(132, 9, 'অকট্যাল সংখ্যা পদ্ধতির বৃহত্তম অঙ্ক কোনটি?', NULL, '১', '৭', '৮', '১০', '2', NULL, NULL, '2020-06-10 09:12:37', '2020-07-01 12:29:59'),
(133, 9, 'অকটাল সংখ্যা পদ্ধতিতে ১৭৭ এর পরের সংখ্যাটি কত?', 4, '১৭৮', '১৮০', '২০০', '২৭০', '3', NULL, NULL, '2020-06-10 09:14:10', '2020-06-10 09:14:10'),
(134, 9, 'অকট্যাল সংখ্যা পদ্ধতিতে ৭ এর পরের সংখ্যা কত?', NULL, '৮', '১০', '১২', '২০', '2', NULL, NULL, '2020-06-10 09:16:29', '2020-07-01 11:57:13'),
(135, 9, 'অক্টাল সংখ্যা পদ্ধতির উদ্ভাবক কে?', NULL, 'গটফ্রিজ লিবনিজ', 'রাজা ৭ম চার্লস', 'আল খোয়ারিজমি', '. আল হ্যাজেন', '2', NULL, NULL, '2020-06-10 09:17:40', '2020-06-10 09:17:40'),
(136, 9, 'এক বাইট প্রকাশ করার জন্য কতটি অক্টাল সংখ্যার প্রয়োজন?', NULL, '. ২', '৩', '৪', '৫', '2', NULL, NULL, '2020-06-10 09:19:08', '2020-06-10 09:19:08'),
(137, 9, 'অকট্যাল পদ্ধতিকে বাংলায় কী বলা হয়?', NULL, 'বাইনারি', 'দশমিক', '. অষ্টমিক', 'হেক্সাডেসিম্যাল', '3', NULL, NULL, '2020-06-10 09:20:44', '2020-07-01 11:56:56'),
(138, 9, '(৩৭)৮ এর পরের সংখ্যা কোনটি?', NULL, '(৩৬)৮', '. (৩৮)৮', '(৪০)৮', '(৫০)৮', '3', NULL, NULL, '2020-06-10 09:21:48', '2020-06-10 09:21:48'),
(139, 9, '(৪৬৭)৮ এর পরের সংখ্যা কত?', NULL, '(৪৬৮)¬৮', '(৪৭০)৮', '(৪৭৭)৮', '(৪৫৭)৮', '2', NULL, NULL, '2020-06-10 09:22:39', '2020-06-10 09:22:39'),
(140, 12, 'ডেসিমাল সংখ্যা পদ্ধতির ভিত্তি কত?', NULL, '২', '৮', '. ১০', '১৬', '3', NULL, NULL, '2020-06-10 09:24:43', '2020-06-10 09:24:43'),
(141, 12, '(১০১১১)২ এর সমতুল্য দশমিক মান কত?', NULL, '২২', '২৩', '. ৩১', '. ৪৩', '2', NULL, NULL, '2020-06-10 09:26:05', '2020-06-10 09:26:05'),
(142, 12, 'শিক্ষক ছাত্রকে রোল নম্বর লিখতে বলায় সে লিখল ১০০১। দশমিক পদ্ধতিতে ছাত্রটির রোল নম্বর কত হবে?', NULL, '৫', '৯', '১৬', '১৭', '2', NULL, NULL, '2020-06-10 09:27:01', '2020-06-10 09:27:01'),
(143, 12, '. (১১০১)২ = (?)১০', NULL, '১২', '১৩', '১৪', '১৫', '3', NULL, NULL, '2020-06-10 09:27:58', '2020-06-10 09:27:58'),
(145, 12, 'বাইনারিতে একটি বইয়ের দাম ১০০১০১১ হলে ডেসিমালে কত?', NULL, '৭০', '৭৫', '৭৮', '৮০', '2', NULL, NULL, '2020-06-10 09:30:45', '2020-06-10 09:30:45'),
(146, 12, 'দশমিক চিহ্ন (.) ছাড়া সংখ্যাকে কী বলা হয়?', NULL, 'ভগ্নাংশ', 'অমূলদ সংখ্যা', 'জটিল সংখ্যা', '. পূর্ণসংখ্যা', '4', NULL, NULL, '2020-06-10 09:32:48', '2020-06-10 09:32:48'),
(147, 12, 'ভগ্নাংশযুক্ত সংখ্যার র‌্যাডিক্স পয়েন্টের বাম দিকের অংশকে কী বলে?', NULL, 'পূর্ণ সংখ্যা', 'ভগ্নাংশ', 'র‌্যাডিক্স পয়েন্ট', 'অমূলদ', '1', NULL, NULL, '2020-06-10 09:33:49', '2020-06-10 09:33:49'),
(148, 12, 'ভগ্নাংশ যুক্ত সংখ্যার র‌্যাডিক্স পয়েন্টের ডান দিকের অংশকে কী বলে?', NULL, 'পূর্ণ সংখ্যা', 'ভগ্নাংশ', 'র‌্যাডিক্স পয়েন্ট', '. অমূলদ', '2', NULL, NULL, '2020-06-10 09:34:59', '2020-06-10 09:34:59'),
(149, 12, 'জারিফ : জানিস, আমার বয়স বাইনারিতে ১১০১। \n ইবাদ : তাহলে আমি তোর চেয়ে ১ বছরের বড়।\n ইবাদের বয়স ডেসিমালে কত বছর?', NULL, '১২', '১৩', '১৪', '. ১৫', '3', NULL, NULL, '2020-06-10 09:35:58', '2020-06-10 09:35:58'),
(150, 12, 'দশমিক পূর্ণসংখ্যাক বাইনারি সংখ্যায় রূপান্তরিত করার জন্য ঐ সংখ্যাটিকে বাইনারি সংখ্যার ভিত্তি ২ দিয়ে বার বার কী করতে হয়?', NULL, 'গুণ করতে হয়', 'ভাগ করতে হয়', 'যোগ করতে হয়', 'বিয়োগ করতে হয়', '2', NULL, NULL, '2020-06-11 04:13:18', '2020-06-11 04:13:18'),
(151, 12, 'দশমিক ভগ্নাংশ সংখ্যাকে বাইনারি সংখ্যায় রূপান্তরিত করার জন্য ঐ সংখ্যাটিকে বাইনারি সংখ্যার ভিত্তি ২ দিয়ে বার বার কী করতে হয়?', NULL, 'গুণ করতে হয়', 'ভাগ করতে হয়', 'যোগ করতে হয়', 'বিয়োগ করতে হয়', '1', NULL, NULL, '2020-06-11 04:14:31', '2020-06-11 04:14:31'),
(152, 12, 'কম্পিউটারে তথ্য প্রদর্শনের কাজে কোন পদ্ধতি ব্যবহৃত হয়?', NULL, 'বাইনারি', 'অক্টাল', 'দশমিক', 'হেক্সাডেসিম্যাল', '3', NULL, NULL, '2020-06-11 04:16:05', '2020-06-11 04:16:05'),
(153, 12, '(৭১.৫৪)৮ এর দশমিক সমতুল্য মান কত?', NULL, '৪৭.৬৭৫৮', '৫৭.৬৮৭৫', '৬৭.৬৮৭৫', '৭৭.৬৭৫৮', '2', NULL, NULL, '2020-06-11 04:17:16', '2020-06-11 04:17:16'),
(154, 13, '১৬ ভিত্তিক সংখ্যায় ইংরেজি বর্ণমালার কয়টি প্রতীক রয়েছে?', NULL, 'চারটি', 'ছয়টি', 'আটটি', 'দশটি', '2', NULL, NULL, '2020-06-11 04:19:12', '2020-06-11 04:19:12'),
(155, 13, 'হেক্সাডেসিমাল পদ্ধতির ভিত বা বেজ কত?', NULL, '২', '৮', '১০', '১৬', '4', NULL, NULL, '2020-06-11 04:20:15', '2020-06-11 04:20:15'),
(156, 13, '(১০০১১০১০)২ কে কোন সংখ্যা পদ্ধতিতে প্রকাশ করতে সবচেয়ে কম সংখ্যক অঙ্ক প্রয়োজন?', NULL, 'বাইনারি', 'অক্টাল', 'হেক্সাদশমিক', 'দশমিক', '3', NULL, NULL, '2020-06-11 04:21:39', '2020-06-11 04:21:39'),
(157, 14, '১১০০ + ১০০০ এ বাইনারি সংখ্যার যোগফল কত?', NULL, '১০১১০', '১০১০০', '১১০০', '১০১০১', '2', NULL, NULL, '2020-06-11 04:24:26', '2020-06-11 04:24:26'),
(158, 14, 'বাইনারি নিয়মে গুণ করা মানে—', NULL, 'বার বার যোগ', 'বার বার বিয়োগ', 'বার বার গুণ', 'বার বার ভাগ', '1', NULL, NULL, '2020-06-11 04:44:14', '2020-06-11 04:44:14'),
(159, 14, '১ + ১ + ১ এর বাইনারি যোগফল কত?', NULL, 'যোগফল = ০, ক্যারি = ০', 'যোগফল=০, ক্যারি=১', 'যোগফল = ১, ক্যারি = ০', 'যোগফল=১, ক্যারি=১', '4', NULL, NULL, '2020-06-11 04:47:35', '2020-06-11 04:47:35'),
(160, 14, 'কোন পদ্ধতিতে কম্পিউটার বিয়োগের কাজ সম্পন্ন করে?', NULL, 'পূরক', 'বাইনারি', 'অঙ্ক', 'সংখ্যা', '1', NULL, NULL, '2020-06-11 04:48:42', '2020-06-11 04:48:42'),
(161, 14, 'অক্টাল পদ্ধতিতে ৭০ থেকে ৩৫ এর বিয়োগফল কোনটি?', NULL, '৩৩', '৩৫', '৪৩', '৫৫', '1', NULL, NULL, '2020-06-11 04:50:08', '2020-06-11 04:50:08'),
(162, 14, '১০১.০০০ থেকে .১১০ এর বিয়োগফল কোনটি?', NULL, '১.০১', '১০.১', '১০০.০১', '১০০.১১', '2', NULL, NULL, '2020-06-11 04:52:02', '2020-06-11 04:52:02'),
(163, 14, '১+১+১+১+১ = ( )২', NULL, '১০০', '১০১', '১১০', '১১১', '2', NULL, NULL, '2020-06-11 04:53:06', '2020-06-11 04:53:06'),
(165, 15, 'ধনাত্মক ও ঋণাত্মক সংখ্যার পারস্পরিক পরিবর্তনকে বলে', NULL, 'পরিপূরক', 'বিপরীতকরণ', 'বিয়োগ', 'যোগ', '1', NULL, NULL, '2020-06-11 09:23:51', '2020-06-11 09:23:51'),
(166, 15, 'ধনাত্মক সংখ্যার জন্য চিহ্ন বিটের মান কী হবে?', NULL, '১', '০', '১', '১১', '2', NULL, NULL, '2020-06-11 09:25:55', '2020-06-11 09:25:55'),
(168, 15, '৮বিট রেজিস্টারে “ ৮ ” এর ২’র পরিপূরক হলো', NULL, '০০১০১১১১', '১১১১১০০০', '১১০১০০১১', '১০০১১১১০', '2', NULL, NULL, '2020-06-11 09:30:18', '2020-06-11 09:30:18'),
(169, 15, 'দশমিক সংখ্যা ১২ এর ২ এর পরিপূরক কত?', NULL, '১১০০', '০১০১', '০০১১', '০১০০', '4', NULL, NULL, '2020-06-11 09:31:58', '2020-06-11 09:31:58'),
(170, 15, 'দশমিক সংখ্যা ১২ এর ২\'ং পড়সঢ়ষবসবহঃ কত', 19, '০০০০১১০০', '১১১১১১০০', '১১১১০০১১', '১১১১০১০০', '4', NULL, NULL, '2020-06-11 09:56:38', '2020-06-11 09:56:38'),
(171, 15, '(০০০০০১০১)২ এর ২ এর পূরিপূরক কোনটি?', NULL, '১১১১১০১০', '১১১১১০১১', '১১১১১১১০', '১১১১০০১০', '2', NULL, NULL, '2020-06-11 09:58:41', '2020-06-11 09:58:41'),
(173, 15, '১ এর পরিপূরকের ক্ষেত্রে (১১১০১১১০)২এর সমতুল্য দশমিক মান কত?', NULL, ' ১৭', '১৭', ' ১১০', '২৩৮', '2', NULL, NULL, '2020-06-11 09:59:52', '2020-06-11 09:59:52'),
(175, 17, 'কম্পিউটার সিস্টেমে ব্যবহৃত প্রতিটি বর্ণ, সংখ্যা ও বিশেষ চিহ্নকে আলাদাভাবে ঈচট কে বোঝানোর জন্য বিটের (০,১) ভিন্ন ভিন্ন বিন্যাসের সাহায্যে অদ্বিতীয় সংকেত তৈরি করা হয়। এ অদ্বিতীয় সংকেতকে কী বলে?', NULL, 'প্যারিটি বিট', 'সাইন বিট', 'কোড', 'সিম্বল', '3', NULL, NULL, '2020-06-11 10:02:35', '2020-06-11 10:02:35'),
(176, 16, 'রোবোটিক্স কী?', 4, 'রোবোট বিজ্ঞান', 'রোবোটের ক্রিয়ানীতি', 'শিল্পে ব্যবহৃত রোবোট', 'রোবোট তৈরিতে ব্যবহৃত ভাষা', '1', NULL, NULL, '2020-06-11 10:02:36', '2020-06-11 10:02:36'),
(177, 16, 'নিচের কোনটি রোবোট শব্দের অর্থ প্রকাশ করে?', NULL, 'ভিনগ্রহবাসী', 'কৃত্রিম যন্ত্র', 'যন্ত্রমানব', 'উন্নততর জীব', '3', NULL, NULL, '2020-06-11 10:03:18', '2020-06-11 10:03:18'),
(178, 17, 'কম্পিউটারের ডেটা ইনপুটের জন্য কোন পদ্ধতি ব্যবহার করা হয়?', NULL, 'কোডিং', 'ডিকোডিং', 'এনকোডিং', 'ডিকোডার', '3', NULL, NULL, '2020-06-11 10:05:08', '2020-06-11 10:05:08'),
(179, 16, 'নিজস্ব বুদ্ধিমত্তা নেই কোনটির?', NULL, 'ভাইরাস', 'পিঁপড়া', 'রোবোট', 'মানুষ', '3', NULL, NULL, '2020-06-11 10:05:40', '2020-06-11 10:05:40'),
(180, 17, 'কম্পিউটারের ডেটা প্রসেসিং শেষে আউটপুটের কোন পদ্ধতি ব্যবহার করা হয়?', NULL, '. এনকোডিং', 'ডিকোডিং', 'এনকোডার', 'ডিকোডার', '2', NULL, NULL, '2020-06-11 10:08:17', '2020-06-11 10:08:17'),
(181, 17, 'সংখ্যা, অক্ষর, বিশেষ চিহ্ন ইত্যাদি নির্দেশ করার জন্য ব্যবহৃত হয় কোনটি?', NULL, 'বিট', 'বাইট', 'কোড', 'আইপি', '3', NULL, NULL, '2020-06-11 10:10:09', '2020-06-11 10:10:09'),
(182, 16, 'অ্যাকচুয়েটর ব্যবহার করা হয় কোন ক্ষেত্রে', 20, 'রোবোটিক্স', 'বায়োমেট্রিক্স', 'ভার্চুয়াল রিয়েলিটি', 'বায়োইনফরমেটিক্স', '1', NULL, NULL, '2020-06-11 10:16:19', '2020-06-11 10:16:19'),
(183, 16, 'কোনটি রোবোটের ব্যবহার?', 13, 'জটিল সার্জারি চিকিৎসায়', 'ব্যক্তির স্বাক্ষর শনাক্তকরণে', 'নতুন জাতের বীজ উৎপাদনে', 'টেনিস বলের আকৃতি তৈরিতে', '1', NULL, NULL, '2020-06-11 10:18:52', '2020-06-11 10:18:52'),
(184, 16, 'রোবোটিক্স-এ সাধারণ বিষয়গুলো কোনটি?', NULL, 'কৃত্রিম বুদ্ধিমত্তা, ইঞ্জিনিয়ারিং, মনোবিদ্যা', 'কৃত্রিম বুদ্ধিমত্তা', 'ইঞ্জিনিয়ারিং', 'মনোবিদ্যা', '1', NULL, NULL, '2020-06-11 10:21:41', '2020-06-11 10:21:41'),
(185, 19, 'আলফানিউমেরিক কোড কয়টি?', NULL, '২', '৩', '৪', '৫', '3', NULL, NULL, '2020-06-11 23:00:23', '2020-06-11 23:00:23'),
(186, 19, 'কত সালে সর্বপ্রথম আলফানিউমেরিক কোড উদ্ভাবিত হয়েছিল?', NULL, '১৭৩৭', '১৮৩৭', '১৯৩৭', '১৯৪৭', '3', NULL, NULL, '2020-06-11 23:04:01', '2020-06-11 23:04:01'),
(187, 19, 'আলফানিউমেরিক কোডের সর্বোচ্চ বিট সংখ্যা কত?', NULL, '৬৪', '১২৮', '২৬৫', '৫১২', '2', NULL, NULL, '2020-06-11 23:05:12', '2020-06-11 23:05:12'),
(188, 19, 'কম্পিউটারে ব্যবহৃত বর্ণ, অঙ্ক, গাণিতিক চিহ্ন ও বিশেষ চিহ্নের জন্য ব্যবহৃত কোডকে কী বলে?', NULL, 'বিসিডি কোড', 'আলফানিইমেরিক কোড', 'আসকি কোড', 'ইউনিকোড', '2', NULL, NULL, '2020-06-11 23:24:34', '2020-06-11 23:24:34'),
(189, 20, 'কত সালে সর্বপ্রথম ইবিসিডিআইসি কোড উদ্ভাবিত হয়েছিল?', NULL, '১৯২০-১৯৩৪', '১১৯৩০-১৯৪৪', '১৯৪০-১৯৫৪', '১৯৫০-১৯৬৪', '3', NULL, NULL, '2020-06-11 23:26:19', '2020-06-11 23:26:19'),
(191, 22, 'ইউনিকোডের বিটের সংখ্যা কত?', NULL, '৪', '৮', '১৬', '৩২', '3', NULL, NULL, '2020-06-12 07:58:26', '2020-06-12 07:58:26'),
(192, 22, 'কত সালে ইউনিকোড উদ্ভাবিত হয়েছিল?', NULL, '১৭৫৭', '১৭৮৭', '১৮৫৭', '১৮৮৭', '3', NULL, NULL, '2020-06-12 08:00:25', '2020-06-12 08:00:25'),
(193, 22, 'বর্তমানে ইউনিকোডের মোট সংখ্যা কত?', NULL, '৫৬৫৩৬', '৫৬৬৩৬', '৬৫৫৩৬', '৬৬৫৩৬', '3', NULL, NULL, '2020-06-12 09:51:26', '2020-06-12 09:51:26'),
(194, 16, 'রোবোট শব্দটি মূলতঃ কোন ভাষা থেকে এসেছে?', NULL, 'স্প্যানিশ', 'গ্রিক', 'স্লাভিক', 'ল্যাটিন', '3', NULL, NULL, '2020-06-13 08:51:03', '2020-06-13 08:51:03'),
(195, 16, 'যুক্তরাষ্ট্রের নাসা কর্তৃক মঙ্গলগ্রহে পাঠানো রোবোটটির নাম কী', NULL, 'কিউরিসিটি', 'অ্যাপোলো', 'ভেরেনা', 'ভস্টক', '1', NULL, NULL, '2020-06-13 08:52:12', '2020-06-13 08:52:12'),
(196, 16, 'কোন সায়েন্স ফিকশন রাইটার সর্বপ্রথম রোবোটিক্স শব্দটি ব্যবহার করেন?', NULL, 'কারেল কাপেক', 'আইজ্যাক অসিমভ', 'জ্যাক উইলিয়ামসন', 'জুলেভার্ন', '2', NULL, NULL, '2020-06-13 08:53:11', '2020-06-13 08:53:11'),
(197, 16, 'মানুষের দুঃসাধ্য কাজের প্রযুক্তি কোনটি?', 21, 'রোবোটিক্স', 'ভার্চুয়াল রিয়েলিটি', 'ন্যানোটেকনোলজি', 'কৃত্রিম বুদ্ধিমত্তা', '1', NULL, NULL, '2020-06-13 08:54:27', '2020-06-13 08:54:27'),
(198, 16, 'কোন পদ্ধতিতে অপঃঁধঃড়ৎ ব্যবহৃত হয়?', 10, 'জেনেটিক ইঞ্জিনিয়ারিং', 'ন্যানো টেকনোলজি', 'রোবোটিক্স', 'বায়োইনফরমেটিক্স', '3', NULL, NULL, '2020-06-13 08:56:41', '2020-06-13 08:56:41'),
(207, 23, 'ব্যক্তির নাম কোন ধরনের ডেটা?', 13, 'Text', 'Record', 'Number', 'Value', '1', NULL, NULL, '2020-06-29 02:57:48', '2020-06-29 02:57:48'),
(208, 23, 'কোন সম্পর্কটি সঠিক?', 7, 'কুয়েরি বাছাই', 'সর্টিং খোঁজা', 'ইনডেক্সিং সাজানো', 'সার্চিং শনাক্ত', '3', NULL, NULL, '2020-06-29 03:01:06', '2020-06-29 03:01:06'),
(209, 23, 'শর্তসাপেক্ষে ডেটা অনুসন্ধান করাকে কি বলে?', 11, 'মডিউল', 'কুয়েরি', 'সর্টিং', 'ইনডেক্সিং', '2', NULL, NULL, '2020-06-29 03:02:39', '2020-06-29 03:02:39'),
(210, 23, 'ফন্টের নাম পরিবর্তন করতে কোন অ্যাট্রিবিউট ব্যবহৃত হয়?', 22, 'ঝরুব', 'ঘধসব', 'ঋধপব', 'ঈড়ষড়ৎ', '3', NULL, NULL, '2020-06-29 03:05:55', '2020-06-29 03:05:55'),
(211, 23, 'কোনটি ডেটাবেজের সবচেয়ে বড় ডেটা টাইপ?', 3, 'টেক্সট', 'নাম্বার', 'কারেন্সি', 'মেমো', '4', NULL, NULL, '2020-06-29 03:08:15', '2020-06-29 03:08:15'),
(212, 23, 'ডেটাবেজের ভিত্তি কোনটি?', 38, 'ফিল্ড', 'রেকর্ড', 'টেবিল', 'কুয়েরি', '1', NULL, NULL, '2020-06-29 03:31:59', '2020-06-29 03:31:59'),
(213, 23, 'টেক্সট ডেটা টাইপে বর্ণের সংখ্যা সর্বোচ্চ কত হতে পারে?', 48, '১২৮', '২৫৫', '২৫৬', '৫১২', '2', NULL, NULL, '2020-06-29 03:34:02', '2020-06-29 03:34:02'),
(214, 22, 'এক বা একাধিক রেকর্ড নিয়ে কি গঠিত হয়?', 38, 'ফিল্ড', 'টেবিল', 'ডেটাবেজ', 'কী ফিল্ড', '2', NULL, NULL, '2020-06-29 03:35:30', '2020-06-29 03:35:30'),
(215, 23, 'একই ধরনের ডেটা থাকে কোনটিতে?', 59, 'ফিল্ডে', 'ডেটা টেবিলে', 'রেকর্ডে', 'সম্পর্কযুক্ত ফিল্ডে', '1', NULL, NULL, '2020-06-29 03:36:47', '2020-06-29 03:36:47'),
(216, 23, 'কোন ধরনের ডেটাটাইপের মাধ্যমে ডেটাবেজ হতে ওয়েব পেজের লিংক করা যায়?', 134, 'OLE object', 'Memo', 'Hyperlink', 'Look up wizard', '3', NULL, NULL, '2020-06-29 03:38:24', '2020-06-29 03:40:08'),
(217, 23, 'Name এর ভিত্তিতে A-Z সর্টেড টেবিলের রেকর্ডগুলোকে Name এর ভিত্তিতে Z-A ইনডেক্সিং করার পর মূল টেবিলে কতগুলো নতুন রেকর্ড এন্ট্রি করলে মূল টেবিলে কিরূপ পরিবর্তন হবে?', 38, 'সম্পূর্ণ টেবিল Name এর ভিত্তিতে A-Z সর্টেড হবে', 'সম্পূর্ণ টেবিল Name এর ভিত্তিতে Z-A সর্টেড হবে', 'নতুন এন্ট্রিকৃত রেকর্ডগুলো আনসর্টেড থাকবে', 'শুধু নতুন রেকর্ডগুলো Z-A সর্টেড হবে', '3', NULL, NULL, '2020-06-29 03:48:04', '2020-06-29 03:48:04'),
(218, 23, '৩য় টেবিল থাকে কোন রিলেশনে?', 82, 'One to One', 'One to Many', 'Many to One', 'Many to Many', '4', NULL, NULL, '2020-06-29 03:49:45', '2020-06-29 03:49:45'),
(219, 23, 'ডেটা এনক্রিপ্টশন ও ডিক্রিপ্টশনের নিয়ম কোনটি?', 82, 'সাইবারনেট্রিক্স', 'ক্রিপ্টোগ্রাফি', 'ইনফরমেট্রিক্স', 'সাইটোগ্রাফি', '2', NULL, NULL, '2020-06-29 03:51:46', '2020-06-29 03:51:46'),
(220, 23, 'কোন ফিল্ডটি প্রাইমারি কী হতে পারে?', 82, 'Name', 'Address', 'Fee', 'Mobile No', '4', NULL, NULL, '2020-06-29 03:53:38', '2020-06-29 03:53:38'),
(221, 23, 'ডেটাবেজের কুয়েরিকৃত ডেটাকে সামারি আকারে উপস্থাপন করা হয় কোন কুয়েরির মাধ্যমে?', 82, 'Select', 'Crosstab', 'Parameter', 'Action', '2', NULL, NULL, '2020-06-29 03:55:43', '2020-06-29 03:55:43'),
(222, 23, 'ডেটাবেজ থেকে কোনো তথ্য খোঁজার জন্য কোনটি ব্যবহার করা হয়?', 126, 'DBMS', 'CESAR', 'SQL', 'RDBMS', '3', NULL, NULL, '2020-06-29 03:58:39', '2020-06-29 03:58:39'),
(223, 23, 'ডেটাবেজে কোনগুলো একই অর্থে ব্যবহার করা হয়?', 126, 'এনটিটি ও টেবিল', 'এনটিটি সেট ও টেবিল', 'টেবিল ও কলাম', 'এট্রিবিউট ও ফিল্ড', '4', NULL, NULL, '2020-06-29 03:59:58', '2020-06-29 03:59:58'),
(224, 23, '‘Name’ কোন ধরনের ডেটা?', 104, 'Logical', 'Number', 'Text', 'Currency', '3', NULL, NULL, '2020-06-29 04:01:36', '2020-06-29 04:01:36'),
(225, 23, 'SQL এর পূর্ণরূপ কি?', 104, 'Search and Query Language', 'Simulation for Query Language', 'Standard Query Language', 'Structured Query Language', '4', NULL, NULL, '2020-06-29 04:56:01', '2020-06-29 04:56:01'),
(226, 23, 'SQL এর পুর্ণরূপ-', 25, 'Sequential Query Language', 'Structured Query Language', 'Serial Query Language', 'Select Query Language', '2', NULL, NULL, '2020-06-29 04:58:48', '2020-06-29 04:58:48'),
(227, 23, 'ডেটাবেজ রেকর্ড বাদ দেয়ার অপশন কোনটি?', 70, 'Delete Data', 'Delete Field', 'Delete record', 'Delete row', '4', NULL, NULL, '2020-06-29 05:04:49', '2020-06-29 05:04:49'),
(228, 23, 'ডেটাবেজ মানে হলো-', NULL, 'উপাত্ত ঘাটি', 'উপাত্ত বিন্যাস', 'উপাত্ত সর্টিং', 'উপাত্ত সার্চিং', '1', NULL, NULL, '2020-06-29 05:08:51', '2020-06-29 05:08:51'),
(229, 23, 'ডেটা টেবিল এ Numeric Field কি ধরনের?', NULL, 'সংখ্যা', 'টেক্সট', 'বর্ণ', 'যুক্তিমূলক', '1', NULL, NULL, '2020-06-29 05:10:26', '2020-06-29 05:10:26'),
(230, 23, 'ডেটা টেবিল এ ব্যাক্তির \"নাম\" কোন ধরনের ডেটা?', NULL, 'Date/Time', 'Currency', 'Text', 'Number', '3', NULL, NULL, '2020-06-29 05:15:49', '2020-06-29 05:15:49'),
(231, 23, 'বিপুল পরিমাণে তথ্য থেকে সহজে তথ্য খুজতে কোনটি  ব্যবহার করা হয়?', NULL, 'ডেটাবেজ সফটওয়্যার', 'স্প্রেডশীট সফটওয়্যার', 'প্রেজেন্টেশন সফটওয়্যার', 'ওয়ার্ডপ্রসেসিং সফটওয়্যার', '1', NULL, NULL, '2020-06-29 05:18:58', '2020-06-29 05:18:58'),
(232, 23, 'ডেটা সমৃদ্ধ এক বা একাধিক ফাইলের সমষ্টিকে কি বলা হয়?', NULL, 'ফিল্ড', 'রেকর্ড', 'ডাটাবেজ', 'ফাইল', '3', NULL, NULL, '2020-06-29 05:25:29', '2020-06-29 05:25:29'),
(233, 23, 'নিচের কোনটি ডেটাবেজ প্রোগ্রাম?', NULL, 'ওরাকল', 'পাইথন', 'এ্যাডা', 'নোটপেড', '1', NULL, NULL, '2020-06-29 05:28:58', '2020-06-29 05:28:58'),
(234, 23, 'নিচের কোনটি ডেটা এনক্রিপশনের অংশ নয়?', NULL, 'প্লেইন টেক্সট', 'সাইফার টেক্সট', 'এলগরিদম', 'প্যারিটি বিট', '4', NULL, NULL, '2020-06-29 05:39:23', '2020-06-29 05:39:23'),
(235, 23, 'ডেটাবেজ এর প্রাণ হলো-', 125, 'টেবিল', 'রেকর্ড', 'ফাইল', 'ফিল্ড', '1', NULL, NULL, '2020-06-29 05:43:03', '2020-06-29 05:43:03'),
(236, 24, 'নিচের কোনটি DBMS এর উদাহরণ?', NULL, 'MS EXCEL', 'MS DOC', 'C++', 'MS ACCESS', '4', NULL, NULL, '2020-06-29 05:45:01', '2020-06-29 05:45:01'),
(237, 23, 'প্রাইমারি ফিল্ডের ডেটাগুলো কেমন হওয়া অত্যাবশ্যক?', NULL, 'লজক্যাল', 'অটোনাম্বার', 'ইউনিক বা স্বতন্ত্র', 'ক্রমনুনাযায়ী সাজানো', '3', NULL, NULL, '2020-06-29 05:47:11', '2020-06-29 05:47:11'),
(238, 23, 'রিলেশনাল ডেটা মডেলের প্রবর্তক কে?', NULL, 'George Boole', 'Marshal Mcluhan', 'R. F Feymen', 'E. F Codd', '4', NULL, NULL, '2020-06-29 05:48:55', '2020-06-29 05:48:55'),
(239, 23, 'Foreign Key এর সাথে Primary Key এর রিলেশন কিরূপ?', 70, 'One to One', 'One to Many', 'Many to One', 'Many to Many', '1', NULL, NULL, '2020-06-29 05:51:11', '2020-06-29 05:51:11'),
(240, 23, 'একটি শিক্ষা প্রতিষ্ঠানের শিক্ষার্থীদের ডেটাবেজে অ্যাট্রিবিউট হলো রোল, নাম, বিভাগ, ঠিকানা। এক্ষেত্রে প্রাইমারি কী কোনটি?', NULL, 'ঠিকানা', 'রোল', 'নাম', 'বিভাগ', '2', NULL, NULL, '2020-06-29 05:53:23', '2020-06-29 05:53:23'),
(241, 23, 'কোন ফিল্ডটি প্রাইমারি কী হতে পারে?', NULL, 'নাম', 'মোবাইল', 'পরীক্ষার ফি', 'ঠিকানা', '2', NULL, NULL, '2020-06-29 05:54:33', '2020-06-29 05:54:33'),
(242, 23, 'নিম্নের কোনটি ডেটাবেজ ম্যানেজমেন্ট সফটওয়্যার?', 103, 'MS Powerpoint', 'MS Excel', 'MS Word', 'MS Access', '4', NULL, NULL, '2020-06-29 05:57:24', '2020-06-29 05:57:24'),
(243, 23, 'নিচের কোনটি ফরেন কী, যখন একটি টেবিলের অ্যাট্রিবিউট Roll, Academic, Year এবং অপর একটি টেবিলের অ্যাট্রিবিউট Roll,Marks,Grade?', NULL, 'Marks', 'Academic Year', 'Roll', 'Grade', '3', NULL, NULL, '2020-06-29 06:00:28', '2020-06-29 06:00:28'),
(244, 23, 'একটি টেবিলে প্রাইমারি কী কয়টি থাকতে পারে?', NULL, 'একটি', 'দুইটি', 'তিনটি', 'পাচটি', '1', NULL, NULL, '2020-06-29 06:01:47', '2020-06-29 06:01:47'),
(245, 23, 'ডেটাবেজের নির্দিষ্ট শর্তের ভিত্তিতে তথ্য খোজ করার জন্য কি ব্যবহার করতে হয়?', NULL, 'কুয়েরি', 'সার্চিং', 'রিলেশন', 'ইন্ডেক্স', '1', NULL, NULL, '2020-06-29 06:07:02', '2020-06-29 06:07:02'),
(246, 23, 'নাম (NAME) ফিল্ড প্রাইমারি কী নয় কেন?', NULL, 'একাধিক ব্যাক্তির একই নাম হতে পারে', 'একই ব্যাক্তির নাম একটি', 'নাম অ্যাট্রিবিউট বহির্ভুত', 'ভিন্ন ভিন্ন ব্যাক্তির নাম সবসময় ভিন্ন ভিন্ন', '1', NULL, NULL, '2020-06-29 06:09:12', '2020-06-29 06:09:12'),
(247, 23, 'রিলেশনাল ডাটাবেজে সর্বনিম্ন ফাইলের সংখ্যা কয়টি?', NULL, 'দুইটি', 'তিনটি', 'চারটি', 'ছয়টি', '1', NULL, NULL, '2020-06-29 06:10:37', '2020-06-29 06:10:37'),
(248, 23, 'ভিন্ন ভিন্ন ডেটা টেবিলগুলোকে একত্রে করে ডেটা সঞ্চালন করার জন্য কী প্রয়োজন?', NULL, 'ভিন্ন ভিন্ন টেবিলে ডেটা এন্ট্রি করা', 'টেবিলগুলোর মধ্যে রিলেশন তৈরী করা', 'টেবিলগুলোর নিরাপত্তা  বিধান করা', 'টেবিলগুলোর মধ্যে কুয়েরী করা', '2', NULL, NULL, '2020-06-29 06:13:30', '2020-06-29 06:13:30'),
(249, 24, 'কোনটি সর্বাধিক ব্যবহৃত অবাণিজ্যিক RDBMS সফটওয়্যার?', NULL, 'DB-2', 'MYSQL', 'MS ACCESS', 'SQL Server', '3', NULL, NULL, '2020-06-29 06:15:41', '2020-06-29 06:15:41'),
(250, 23, 'রিলেশনাল ডেটাবেজ ডেটাকে নিম্নলিখিত কোন উপায়ে সংরক্ষণ করা হয়?', NULL, 'XML', 'FILE', 'TABLE', 'HTML', '3', NULL, NULL, '2020-06-29 06:19:11', '2020-06-29 06:19:11'),
(251, 23, 'ডেটার গোপণীয়তা রক্ষায় গৃহীত ব্যবস্থা কোনটি?', NULL, 'এনক্রিপশন', 'প্লেইন টেক্সট', 'সর্টিং', 'ইনডেক্সিং', '1', NULL, NULL, '2020-06-29 06:21:15', '2020-06-29 06:21:15'),
(252, 23, 'কোন টেবিলের Roll ফিল্ডকে প্রাইমারি Key বলা হয়?', NULL, 'Roll ফিল্ড সংখ্যা দিয়ে লেখা', 'একাধিক ছাত্রের Roll একই হতে পারে না', 'Roll ফিল্ড পরিবর্তনশীল', 'প্রতি Roll কে Value বলে', '2', NULL, NULL, '2020-06-29 06:28:18', '2020-06-29 06:28:18'),
(253, 25, 'রিলেশন ডেটা মডেলের প্রবর্তক কে?', 81, 'George Boole', 'Marshal McLuhan', 'Korel Capek', 'E.F. Codd', '4', NULL, NULL, '2020-06-29 06:33:47', '2020-06-29 06:33:47'),
(254, 25, 'পরস্পর সম্পর্কযুক্ত কয়েকটি ফাইল নিয়ে গঠিত ডেটাবেজকে বলা হয়-', 37, 'সম্পর্কযুক্ত ডেটাবেজ', 'নিরীক্ষিত ডেটাবেজ', 'গুচ্ছ ডেটাবেজ', 'অনিয়ন্ত্রিত ডেটাবেজ', '1', NULL, NULL, '2020-06-29 06:35:54', '2020-06-29 06:35:54'),
(255, 26, 'কোন কারণে সর্ট এর তেমন কোন ব্যবহার নেই?', NULL, 'এটি ইনডেক্সিং আউটপুটের চেয়ে কম মেমোরি দখল করে', 'এটি ইনডেক্সিং আউটপুটের চেয়ে বেশি মেমোরি দখল করে', 'সব ফিল্ড সর্ট করা যায় না', 'ডেটা সর্ট করার প্রয়োজন হয় না', '2', NULL, NULL, '2020-06-29 06:40:29', '2020-06-29 06:40:29'),
(256, 24, 'কোনটি RDBMS নয়?', NULL, 'DB-2', 'c++', 'SQL', 'MySQL', '2', NULL, NULL, '2020-06-29 06:42:58', '2020-06-29 06:42:58'),
(257, 26, 'একটি রেকর্ডের সঙ্গে অনেকগুলো রেকর্ড সম্পর্কযুক্ত হয় কোনটিতে?', NULL, 'One to One', 'One to Many', 'Many to One', 'Many to Many', '2', NULL, NULL, '2020-06-29 06:44:45', '2020-06-29 06:44:45'),
(258, 26, 'ডেটাফাইল তৈরীর সঠিক অনুক্রম কোনটি?', NULL, 'বর্ণ - ফিল্ড - রেকর্ড - ডেটাবেজ', 'ফিল্ড - রেকর্ড - টেবিল - ডেটাবেজ', 'রেকর্ড - ফিল্ড - তথ্য - ডেটাবেজ', 'রেকর্ড - ফিল্ড - বর্ণ - ডেটাবেজ', '2', NULL, NULL, '2020-06-29 06:49:02', '2020-06-29 06:49:02'),
(259, 26, 'কুয়েরি হলো-', NULL, 'ডেটাবেজ আপডেট রাখা', 'ডেটাবেজ ফাইল সংরক্ষণ করা', 'ডেটাবেজ থেকে কিছু খুজে বের করা', 'ডেটাবেজ ফাইল সাজানো', '3', NULL, NULL, '2020-06-29 06:50:55', '2020-06-29 06:50:55'),
(260, 26, 'Update কোন কুয়েরির অন্তর্ভূক্ত?', 103, 'Select', 'Parameter', 'Crosstab', 'Action', '1', NULL, NULL, '2020-06-29 06:52:48', '2020-06-29 06:52:48'),
(261, 26, 'শর্তসাপেক্ষে ডেটাবেজ থেকে কোন ডেটা খুজে বের করাকে কি বলা হয়?', NULL, 'সর্টিং', 'কুয়েরি', 'সার্চিং', 'ইন্ডেক্সিং', '2', NULL, NULL, '2020-06-29 06:55:09', '2020-06-29 06:55:09'),
(262, 25, 'পরস্পর সম্পর্কযুক্ত  কয়েকটি ফাইল নিয়ে গঠিত ডেটাবেজকে বলা হয়-', NULL, 'সম্পর্কযুক্ত ডেটাবেজ', 'নিরীক্ষিত ডেটাবেজ', 'গুচ্ছ ডেটাবেজ', 'অনিয়ন্ত্রিত ডেটাবেজ', '1', NULL, NULL, '2020-06-29 08:45:01', '2020-06-29 08:45:01'),
(263, 25, 'ডেটা এনক্রিপ্ট ও ডিক্রিপ্ট করার বিষয় হলো-', NULL, 'ফটোগ্রাফি', 'ক্রিপ্টোগ্রাফি', 'ইনফরমেটিক্স', 'টেরাগ্রাফি', '2', NULL, NULL, '2020-06-29 08:48:17', '2020-06-29 08:48:17'),
(264, 26, 'ডেটাবেজ এ কোনো রেকর্ড সংযোজন ও সংশোধন করলে কি হয়?', 126, 'ইনডেক্স বক্সফাইল আপডেট হয়', 'সর্ট করা ফাইল আপডেট হয়', 'নতুন করে ইনডেক্স করতে হয়', 'রেকর্ডগুলোর অ্যাড্রেস সাজানো হয়', '1', NULL, NULL, '2020-06-29 08:57:09', '2020-06-29 08:57:09'),
(265, 21, 'প্রত্যেকটি এট্রিবিউটে যে মান থাকে তাকে কী বলে?', 126, 'ভ্যালু', 'রেকর্ড', 'ফিল্ড', 'ডেটা', '1', NULL, NULL, '2020-06-29 09:18:11', '2020-06-29 09:18:11'),
(266, 27, 'প্রথম প্রজন্মের ভাষা বলা হয় কোনটিকে?', NULL, 'যান্ত্রিক ভাষা', 'অ্যাসেম্বলি ভাষা', 'উচ্চস্তরের ভাষা', 'অতি উচ্চস্তরের ভাষা', '1', NULL, NULL, '2020-06-29 09:32:06', '2020-06-29 09:32:06'),
(267, 27, 'উচ্চস্তরের ভাষা কে যান্ত্রিক ভাষায় রূপান্তর করাকে কি বলে?', NULL, 'প্রসেসিং', 'ডিবাগিং', 'অনুবাদ', 'মডিউল', '3', NULL, NULL, '2020-06-29 09:33:43', '2020-06-29 09:33:43'),
(268, 27, 'কোন ভাষা কোনো ধরনের রূপান্তর ছাড়া কম্পিউটার সরাসরি নির্বাহ করতে পারে?', NULL, 'মেশিন ভাষা', 'অ্যাসেম্বলি ভাষা', 'উচ্চতরের ভাষা', 'মধ্যম স্তরের ভাষা', '1', NULL, NULL, '2020-06-29 09:36:10', '2020-06-29 09:36:10'),
(269, 27, 'মেশিনের ভাষায় রূপান্তরিত প্রোগ্রামকে কি বলে?', NULL, 'অ্যাসেম্বলার', 'কম্পাইলার', 'ইন্টারপ্রিন্টার', 'অবজেক্ট প্রোগ্রাম', '4', NULL, NULL, '2020-06-29 09:37:46', '2020-06-29 09:37:46'),
(270, 27, 'মেশিন ভাষায় অনুদিত হয় কোনটি?', 70, 'অপারেন্ট', 'লেবেল', 'কমেন্ট', 'অপারেশন কোড', '4', NULL, NULL, '2020-06-29 09:41:09', '2020-06-29 09:41:09'),
(271, 27, 'কোনটি অনুবাদক প্রোগ্রাম?', NULL, 'অ্যাসেম্বলি ল্যাঙ্গুয়েজ', 'কম্পাইলার', 'পাইথন', 'ফক্সপ্রো', '2', NULL, NULL, '2020-06-30 03:01:44', '2020-06-30 03:01:44'),
(272, 27, 'কোন ভাষায় লিখিত প্রোগ্রাম সরাসরি কম্পিউটার বুঝতে পারে?', NULL, 'মেশিন ভাষা', 'হাই লেভেল ভাষা', '4GL', 'চতুর্থ প্রজন্মের ভাষা', '3', NULL, NULL, '2020-06-30 03:03:09', '2020-06-30 03:03:09'),
(273, 27, 'কোনটি স্বাভাবিক ভাষা?', 81, '4GL', '5GL', 'মেশিন ভাষা', 'অ্যাসেম্বলি ভাষা', '2', NULL, NULL, '2020-06-30 03:05:40', '2020-06-30 03:05:40'),
(274, 27, 'কোন অনুবাদক দিয়ে সম্পূর্ণ প্রোগ্রামটি অনুবাদ করা সম্ভব?', NULL, 'অ্যাসেম্বলার', 'কম্পাইলার', 'ইন্টারপ্রিন্টার', 'মেশিন ভাষা', '2', NULL, NULL, '2020-06-30 03:07:01', '2020-06-30 03:07:01'),
(275, 27, 'কোন ভাষা দিয়ে কম্পিউটারের মেমোরি-অ্যাড্রেসের সঙ্গে সরাসরি সংযোগ সাধন সম্ভব?', NULL, 'মেশিন ভাষা', 'হাই লেভেল ভাষা', 'অ্যাসেম্বলি ভাষা', 'চতুর্থ প্রজন্মের ভাষা', '1', NULL, NULL, '2020-06-30 03:08:52', '2020-06-30 03:08:52'),
(276, 27, 'কোনটি উচ্চস্তরের ভাষা?', NULL, 'অ্যাডা', 'অ্যাসেম্বলি ল্যাঙ্গুয়েজ', 'পাইথন', 'মেশিন ল্যাঙ্গুয়েজ', '3', NULL, NULL, '2020-06-30 03:10:00', '2020-06-30 03:10:00'),
(277, 27, 'যান্ত্রিক ভাষাকে কোন স্তরের ভাষা বলা হয়?', NULL, 'উচ্চস্তরের', 'মধ্যস্তরের', 'নিম্নস্তরের', 'অতি উচ্চস্তরের', '3', NULL, NULL, '2020-06-30 03:11:02', '2020-06-30 03:11:02'),
(278, 27, 'অ্যাসেম্বলি ভাষা অনুবাদ করে-', NULL, 'কম্পাইলার', 'ইন্টারপ্রিন্টার', 'অ্যাসেম্বলার', 'ভিডিও', '3', NULL, NULL, '2020-06-30 03:12:18', '2020-06-30 03:12:18'),
(279, 27, 'মানুষের ভাষার সাথে কোন ভাষার মিল আছে?', NULL, 'উচ্চস্তরের', 'নিম্নস্তরের', 'যান্ত্রিক', 'অ্যাসেম্বলি', '1', NULL, NULL, '2020-06-30 03:13:16', '2020-06-30 03:13:16'),
(280, 27, 'মেশিন ভাষার সুবিধা কোনটি?', 59, 'প্রোগ্রাম সহজে লিখা যায়', 'সবধরনের মেশিনে ব্যবহার উপযোগী', 'প্রোগ্রাম সরাসরি ও দ্রুত কার্যকরী হয়', 'প্রোগ্রামের ভুল সহজে শনাক্ত করা যায়', '3', NULL, NULL, '2020-06-30 03:17:21', '2020-06-30 03:17:21'),
(281, 27, 'কোন ভাষায় লিখিত প্রোগ্রাম কম্পিউটার সরাসরি বুঝতে পারে?', 60, 'মেশিন ভাষা', 'উচ্চস্তরের ভাষা', 'অ্যাসেম্বলি ভাষা', 'চতুর্থ প্রজন্মের ভাষা', '1', NULL, NULL, '2020-06-30 03:19:45', '2020-06-30 03:19:45'),
(282, 27, 'নিচের কোনটি অনুবাদক প্রোগ্রাম?', NULL, 'ইন্টারপ্রিন্টার', 'সি++', 'পাইথন', 'প্যাসকেল', '1', NULL, NULL, '2020-06-30 03:20:42', '2020-06-30 03:20:42'),
(283, 27, 'উৎস প্রোগ্রামকে একত্রে বস্তু প্রোগ্রামে রূপান্তর করে কোনটি?', 70, 'কম্পাইলার', 'ইন্টারপ্রিন্টার', 'লিংকার', 'অ্যাসেম্বলার', '1', NULL, NULL, '2020-06-30 03:22:20', '2020-06-30 03:22:20'),
(284, 27, 'অনুবাদক সফটওয়্যার কয় ধরনের?', 38, '২', '৩', '৪', '৫', '2', NULL, NULL, '2020-06-30 03:24:08', '2020-06-30 03:24:08'),
(285, 27, 'প্রোগ্রামিং ভাষার সর্বনিম্নস্তর কোনটি?', 82, 'মেশিন', 'অ্যাসেম্বলি', 'হাইলেভেল', 'ভেরি হাই লেভেল', '1', NULL, NULL, '2020-06-30 03:26:19', '2020-06-30 03:26:19'),
(286, 27, 'ইন্টারপ্রেটার প্রোগ্রামকে-', NULL, 'এক লাইন এক লাইন করে অনুবাদ করে', 'একসাথে পুরো প্রোগ্রাম অনুবাদ করে', 'একসাথে পাচ লাইন করে অনুবাদ করে', 'অর্ধেক অর্ধেক লাইন অনুবাদ করে', '1', NULL, NULL, '2020-06-30 03:28:45', '2020-06-30 03:28:45'),
(287, 27, '4GL বলতে বুঝায়-', 49, 'অতি উচ্চস্তরের ভাষা', 'উচ্চস্তরের ভাষা', 'মধ্যম স্তরের ভাষা', 'নিম্নস্তরের ভাষা', '1', NULL, NULL, '2020-06-30 03:40:21', '2020-06-30 03:40:21'),
(288, 27, 'কোনটি চতুর্থ প্রজন্মের ভাষা?', 70, 'BASIC', 'PASCAL', 'INTELLECT', 'CSL', '4', NULL, NULL, '2020-06-30 03:42:29', '2020-06-30 03:42:29'),
(289, 27, 'কৃত্রিম বুদ্ধিমত্তায় ব্যবুহৃত হয় কোনটি?', 70, 'PYTHON', 'HTML', 'COBOL', 'PROLOG', '4', NULL, NULL, '2020-06-30 03:44:34', '2020-06-30 03:44:34'),
(290, 27, 'নিচের কোনটি তৃতীয় প্রজন্মের ভাষা?', NULL, 'math-matci', 'Matlab', 'C', 'অ্যাসেম্বলি ভাষা', '3', NULL, NULL, '2020-06-30 03:45:41', '2020-06-30 03:45:41'),
(291, 27, 'নিচের কোনটি চতুর্থ প্রজন্মের ভাষা?', NULL, 'C', 'FORTRAN', 'SQL', 'ALGOL', '3', NULL, NULL, '2020-06-30 03:46:53', '2020-06-30 03:46:53'),
(292, 27, 'প্রোগ্রামের ত্রুটি সংশোধনের পদ্ধতিকে কি বলা হয়?', NULL, 'Encoding', 'Amending', 'Debugging', 'Correction', '3', NULL, NULL, '2020-06-30 03:48:08', '2020-06-30 03:48:08'),
(293, 27, 'প্রোকৌশলগত সমস্যা সমাধানের ভাষা কোনটি?', NULL, 'PYTHON', 'HTML', 'BASIC', 'FORTRAN', '4', NULL, NULL, '2020-06-30 03:49:15', '2020-06-30 03:49:15'),
(294, 27, 'C++ কোন প্রজন্মের ভাষা?', NULL, 'প্রথম', 'দ্বিতীয়', 'তৃতীয়', 'চতুর্থ', '3', NULL, NULL, '2020-06-30 03:50:19', '2020-06-30 03:50:19'),
(295, 27, '4GL বলতে কি বুঝায়?', NULL, 'অতি উচ্চতর ভাষা', 'উচ্চতর ভাষা', 'মধ্যম স্তরের ভাষা', 'নিম্নস্তরের ভাষা', '1', NULL, NULL, '2020-06-30 03:51:35', '2020-06-30 03:51:35'),
(296, 27, 'সকল ধনাত্মক পূর্ণসংখ্যাকে  কি বলা হয়?', 38, 'কারেক্টার', 'ইস্টিজার', 'রিয়াল', 'ডাবল', '2', NULL, NULL, '2020-06-30 03:54:02', '2020-06-30 03:54:02'),
(297, 27, 'অ্যাসেম্বলি ভাষা কোন প্রজন্মের?', 71, '১ম', '২য়', '৩য়', '৪র্থ', '2', NULL, NULL, '2020-06-30 03:56:07', '2020-06-30 03:56:07'),
(298, 27, 'প্রবাহচিত্র কি?', NULL, 'বিশেষ চিহ্ন সংবলিত ধারাবাহিক প্রোগ্রাম  নির্বাহ চিত্র', 'প্রোগ্রামের চিত্র', 'প্রোগ্রামের উন্নয়ন চিত্র', 'প্রোগ্রামের অংশের চিত্র', '1', NULL, NULL, '2020-06-30 04:03:18', '2020-06-30 04:03:18'),
(299, 27, 'প্রোগ্রাম ফ্লোচার্টে প্রক্রিয়াকরণের জন্য কোন প্রতীকটি ব্যবহার করা হয়?', 26, 'বৃত্ত', 'সামন্তরিক', 'আয়তক্ষেত্র', 'রম্বস', '3', NULL, NULL, '2020-06-30 04:05:49', '2020-06-30 04:05:49'),
(300, 27, 'Printf () এর মাধ্যমে ডেটা কোথায় পাঠানো হয়?', 71, 'ইনপুট মান ইনপুট মাধ্যমে', 'আউটপুট মান আউটপুট মাধ্যমে', 'ইনপুট মান আউটপুট মাধ্যমে', 'আউটপুট মান ইনপুট মাধ্যমে', '3', NULL, NULL, '2020-06-30 04:09:38', '2020-06-30 04:09:38'),
(301, 27, 'প্রোগ্রামে কোন ধরনের ভুলের জন্য কম্পিউটার  বার্তা দেয়?', 134, 'সিনট্যাক্স ভুল', 'লজিক্যাল ভুল', 'ডেটা ভুল', 'যে কোন ভুল', '1', NULL, NULL, '2020-06-30 04:12:46', '2020-06-30 04:12:46'),
(302, 27, 'সমপ্রকৃতির ডেটার সমাবেশকে কি বলা হয়?', 114, 'স্ট্রাকচার', 'ফাংশন', 'লিংকলিস্ট', 'অ্যারে', '4', NULL, NULL, '2020-06-30 04:14:17', '2020-06-30 04:14:17'),
(303, 27, '++n এর সমতুল্য মান কোনটি?', 125, 'n = n + 1', 'n = n + 2', 'n = n - 1', 'n = n - 2', '1', NULL, NULL, '2020-06-30 04:16:49', '2020-06-30 04:16:49'),
(304, 27, 'প্রোগ্রামের ভুলত্রুটি খুজে বের করে তার সংশোধনের পদ্ধতিকে কি বলে?', 114, 'কোডিং', 'ডিকোডিং', 'এনকোডিং', 'ডিবাগিং', '4', NULL, NULL, '2020-06-30 04:18:31', '2020-06-30 04:18:31'),
(305, 27, 'সুডো শব্দের অর্থ কি?', NULL, 'শৃঙ্খলা', 'পদ্ধতি', 'ত্রুটি', 'ছদ্ম', '4', NULL, NULL, '2020-06-30 04:19:44', '2020-06-30 04:19:44'),
(306, 27, 'কোনটি সম্পর্কযুক্ত অপারেটর?', 104, '+', '> =', 'AND', '<<', '2', NULL, NULL, '2020-06-30 04:21:39', '2020-06-30 04:21:39'),
(307, 27, 'সি হচ্ছে-', NULL, 'অপারেটিং সিস্টেম', 'প্যাকেজ প্রোগ্রাম', 'উচ্চতর প্রোগ্রামিং ভাষা', 'নিম্নতর প্রোগ্রামিং ভাষা', '3', NULL, NULL, '2020-06-30 04:25:20', '2020-06-30 04:25:20'),
(308, 27, 'C ভাষায় লেখা প্রোগ্রামকে কি বলা হয়?', 126, 'আসকি', 'সোর্স', 'অবজেক্ট', 'ইউনি', '2', NULL, NULL, '2020-06-30 04:26:46', '2020-06-30 04:26:46'),
(309, 27, 'প্রোগ্রামের ভিত্তি কোনটি?', NULL, 'কোডিং', 'ফ্লোচার্ট', 'ডিবাগিং', 'প্রসিডিউ', '1', NULL, NULL, '2020-06-30 04:28:03', '2020-06-30 04:28:03'),
(310, 27, 'কোনটি সি ভাষার ফাংশন?', 60, 'int', 'stdio.h', 'printf()', 'FOR', '3', NULL, NULL, '2020-06-30 04:29:33', '2020-06-30 04:29:33'),
(311, 27, 'সি-ভাষায় উপাত্ত গ্রহণের মাধ্যম কোনটি?', 60, 'main()', 'print()', 'scanf()', 'getch()', '3', NULL, NULL, '2020-06-30 04:31:33', '2020-06-30 04:31:33'),
(312, 27, 'তিনটি পূর্ণসংখ্যা (a, b, c) কী-বোর্ডের দ্বারা ইনপুট নেয়ার জন্য ইনপুট ফাংশনের সঠিক ব্যবহার নিচের কোনটি?', 38, 'scanf (“%d, %d, %d”, &b, &c);', 'scanf (“%d, %d, %d”, &a, &b, &c);', 'scanf (“%d, % % %d d d”, &a, &b, &c);', 'scanf (“% d % d % d”, a, b, c);	scanf (“% d % d % d”, a, b, c);', '2', NULL, NULL, '2020-06-30 04:34:49', '2020-06-30 04:34:49'),
(313, 27, 'কোনটি পুনরাবৃতিমূলক স্টেটমেন্ট?', NULL, 'IF - THEN', 'FOR - THEN', 'DO - LOOP', 'FOR - LOOP', '4', NULL, NULL, '2020-06-30 04:36:29', '2020-06-30 04:36:29'),
(314, 27, 'শর্তসাপেক্ষে স্টেটমেন্টগুচ্ছকে নির্বাহ করার জন্য সি প্রোগ্রামিং ভাষায় কোন লুপ ব্যবহার করা হয়?', NULL, 'for লুপ', 'Do while লুপ', 'for while লুপ', 'while লুপ', '3', NULL, NULL, '2020-06-30 04:38:38', '2020-06-30 04:38:38'),
(315, 27, '< = কোন ধরনের অপারেটর?', NULL, 'গাণিতিক', 'রিলেশনাল', 'লজিক্যাল', 'কম অথবা সমান', '2', NULL, NULL, '2020-06-30 04:39:59', '2020-06-30 04:39:59'),
(316, 27, 'সি ভাষায় রিলেশনাল অপারেটর কোন ধরনের?', 37, '২', '৩', '৫', '৬', '4', NULL, NULL, '2020-06-30 04:41:11', '2020-06-30 04:41:11'),
(317, 28, 'C প্রোগ্রামিং ভাষাটি কোন সময়ে উদ্ভাবিত হয়?', NULL, '১৯৬০ সালে', '১৯৭০ সালের শেষ দিকে', '১৯৬০ সালে', '১৯৭১ সালে', '2', NULL, NULL, '2020-06-30 04:43:28', '2020-06-30 04:43:28'),
(318, 28, 'C ভাষাটি কোন অপারেটিং সিস্টেম ব্যবহার করে উদ্ভাবন করা হয়?', NULL, 'Unix', 'Linux', 'Mac', 'Andriod', '1', NULL, NULL, '2020-06-30 04:45:01', '2020-06-30 04:45:01'),
(319, 28, 'নিচের কোনটি কি ওয়ার্ড?', NULL, 'int', 'main', 'printf', 'include', '1', NULL, NULL, '2020-06-30 04:48:13', '2020-06-30 04:48:13'),
(320, 28, '%d  - কোন ধরনের উপাত্ত নিয়ে কাজ করে?', NULL, 'দশমিক পূর্ণসংখ্যা', 'ক্যারেক্টার', 'স্ট্রিং পূর্ণসংখ্যা', 'ফ্লোটিং পয়েন্ট মান', '1', NULL, NULL, '2020-06-30 04:49:27', '2020-06-30 04:49:27'),
(321, 28, 'ফ্ল চার্ট কত প্রকার?', NULL, '২', '৩', '৪', '৫', '1', NULL, NULL, '2020-06-30 05:23:14', '2020-06-30 05:23:14'),
(322, 28, 'y = a2 + b2 একটি গাণিতিক রাশিমালা হলে C প্রোগ্রামের ভাষায় রাশিমালাটির সঠিক রূপান্তর কোনটি?', NULL, 'y = a2 + b * b', 'y = a2 + b * 2', 'y = a * a + b2', 'y = a * a + b * b', '4', NULL, NULL, '2020-06-30 05:25:16', '2020-06-30 05:25:16'),
(323, 28, 'নিচের কোনটি সঠিক চলক?', 26, '-1 test', 'test 1', 'test @ 1', 'test - 1', '4', NULL, NULL, '2020-06-30 05:27:38', '2020-06-30 05:27:38'),
(324, 28, 'C প্রোগ্রামের ভাষায় লেখা প্রোগ্রামকে কি বলা হয়?', NULL, 'গন্তব্য প্রোগ্রাম', 'উৎস প্রোগ্রাম', 'ইউনিকোড', 'আসকি বোড', '2', NULL, NULL, '2020-06-30 05:30:28', '2020-06-30 05:30:28'),
(325, 28, 'কোনটি রিলেশনাল অপারেটর?', NULL, '+', '= =', 'AND', 'OR', '2', NULL, NULL, '2020-06-30 05:32:02', '2020-06-30 05:32:02'),
(326, 28, 'কোন ফাংশনটি সি প্রোগ্রামের জন্য অত্যাবশ্যকীয়?', NULL, 'printf()', 'main()', 'getch()', 'scanf()', '2', NULL, NULL, '2020-06-30 05:33:45', '2020-06-30 05:33:45');
INSERT INTO `questions` (`id`, `topic_id`, `question`, `board_id`, `option1`, `option2`, `option3`, `option4`, `correct_option`, `tag`, `details`, `created_at`, `updated_at`) VALUES
(327, 28, 'Getch () এর প্রয়োজনীয় Header file কোনটি?', NULL, 'stdio.h', 'conio.h', 'math.h', 'graphics.h', '2', NULL, NULL, '2020-06-30 05:35:14', '2020-06-30 05:35:14'),
(328, 28, 'সি ভাষায় নিচের কোন ফাংশন দ্বারা ডেটা ইনপুট করা হয়?', NULL, 'printf()', 'abs()', 'float()', 'scanf()', '4', NULL, NULL, '2020-06-30 05:36:49', '2020-06-30 05:36:49'),
(329, 28, 'সি ভাষায় নিচের কোন ফাংশন দ্বারা প্রোগ্রামের ফলাফল প্রকাশ করা যায়?', NULL, 'printf()', 'sqrt()', 'main()', 'scanf()', '1', NULL, NULL, '2020-06-30 05:38:01', '2020-06-30 05:38:01'),
(330, 28, 'C প্রোগ্রামিং ভাষায় long integer চলক মেমোরিতে কত বাইট জায়গা নেয়?', 49, '২ বাইট', '৪ বাইট', '৮ বাইট', '১৬ বাইট', '4', NULL, NULL, '2020-06-30 05:40:16', '2020-06-30 05:40:16'),
(331, 28, 'সি ভাষায় নিচের কোন ফাংশন দ্বারা বর্গমূল নির্ণয় করা যায়?', NULL, 'printf ()', 'abs ()', 'sqrt ()', 'scanf ()', '3', NULL, NULL, '2020-06-30 05:41:45', '2020-06-30 05:41:45'),
(332, 28, 'নিচের কোনটি অ্যারে চলক?', NULL, 'm(5)', 'm[5]', 'm5', 'm_5', '2', NULL, NULL, '2020-06-30 05:43:10', '2020-06-30 05:43:10'),
(333, 28, 'নিচের কোনটি Two dimensional অ্যারে চলক?', NULL, 'm(4,5)', 'm(4)(5)', 'm[4][5]', 'm,[4,5]', '4', NULL, NULL, '2020-06-30 05:44:42', '2020-06-30 05:44:42'),
(334, 28, 'সি ভাষায় কোনটি সঠিক চলক?', NULL, 'int 5X;', 'int main;', 'int x5;', 'int x-5;', '3', NULL, NULL, '2020-06-30 05:46:44', '2020-06-30 05:46:44'),
(335, 28, 'C ভাষায় সঠিক চলক কোনটি?', 25, 'st-name', '$ stname', 'I stname', 'I st-name', '1', NULL, NULL, '2020-06-30 05:48:17', '2020-06-30 05:48:17'),
(337, 28, 'নিচের কোন ভেরিয়েবলটি ভগ্নাংশ ডেটা ধারণ করে?', NULL, 'int x, y, s;', 'float z;', 'x = 235;', 'y = 188.75', '2', NULL, NULL, '2020-06-30 05:53:50', '2020-06-30 05:53:50'),
(338, 28, 'সি ভাষায় নতুন লাইন তৈরির ব্যাকস্ল্যাস ক্যারেক্টার কোনটি?', NULL, '\\a', '\\b', '\\n', '\\r', '3', NULL, NULL, '2020-06-30 05:55:25', '2020-06-30 05:55:25'),
(339, 28, 'সি ভাষায় switch কোনটি?', NULL, 'ভেরিয়েবল', 'ফাংশন', 'কী-ওয়ার্ড', 'অপারেন্ড', '3', NULL, NULL, '2020-06-30 05:57:00', '2020-06-30 05:57:00'),
(340, 28, 'সি ভাষায় প্রোগ্রাম রচনা হয় কোন বন্ধনীর ভিতরে?', NULL, '()', '{}', '<>', '[]', '2', NULL, NULL, '2020-06-30 06:04:43', '2020-06-30 06:04:43'),
(341, 28, 'সি ভাষায় && কে কোন ধরনের অপারেটর বলা হয়?', 103, 'Arithmetic', 'Relation', 'Logical', 'Assignment', '3', NULL, NULL, '2020-06-30 06:06:49', '2020-06-30 06:06:49'),
(342, 27, 'উৎস প্রোগ্রামকে একত্রে বস্তু প্রোগ্রামে রূপান্তর করে কোনটি?', NULL, 'কম্পাইলার', 'ইন্টারপ্রিটার', 'লিঙ্কার', 'অ্যাসেম্বলার', '1', NULL, NULL, '2020-06-30 06:08:46', '2020-06-30 06:08:46'),
(343, 28, 'Double ডেটা টাইপের জন্য ফরমেট স্পেসিফিয়ার কোনটি?', NULL, '%d', '%f', '%if', '%s', '3', NULL, NULL, '2020-06-30 06:10:36', '2020-06-30 06:10:36'),
(344, 27, 'ইন্টিজার টাইপের ডেটার ফরমেট স্পেসিফাইয়ার কোনটি?', NULL, '%c', '%d', '%f', '%s', '2', NULL, NULL, '2020-06-30 06:12:21', '2020-06-30 06:12:21'),
(345, 28, '\'সি\' ভাষায় ইন্টিজার ডেটা টাইপ কত বিটের?', NULL, '৮', '১৬', '৩২', '৬৪', '3', NULL, NULL, '2020-06-30 06:13:34', '2020-06-30 06:13:34'),
(346, 28, 'সি++ ভাষা কোন  ধরনের প্রোগ্রামিং মডেল অনুসরণ করে?', NULL, 'স্ট্রাকচার্ড', 'অবজেক্ট ওরিয়েন্টেড', 'ভিজুয়াল', 'ইভেন্ট ড্রাইভেন', '2', NULL, NULL, '2020-06-30 06:15:10', '2020-06-30 06:15:10'),
(347, 28, 'সি প্রোগ্রামিং এ কোন স্টেট্মেন্টটি নির্বাহযোগ্য নয়?', NULL, '#include<stdio.h>', 'main()', '/*its a program*/', 'printf();', '3', NULL, NULL, '2020-06-30 06:16:36', '2020-06-30 06:16:36'),
(348, 28, 'সি ভাষার পূর্ণ সংখ্যার ডেটা টাইপ কোনটি?', NULL, 'ক্যারেক্টার', 'ইন্টিজার', 'স্ট্রিং', 'ফ্লোটিং', '2', NULL, NULL, '2020-06-30 06:18:48', '2020-06-30 06:18:48'),
(349, 28, '&& কোন ধরনের লজিক্যাল অপারেটর-', NULL, 'লজিক্যাল AND অপারেশন সম্পন্ন করে', 'লজিক্যাল OR অপারেশন সম্পন্ন করে', 'লজিক্যাল NOT অপারেশন সম্পন্ন করে', 'লজিক্যাল NAND অপারেশন সম্পন্ন করে', '1', NULL, NULL, '2020-06-30 06:20:57', '2020-06-30 06:20:57'),
(350, 28, 'for (i = 1; i < 8; i+ = 2)  \r\nprintf(“%d”; i)\r\nকোনটি উপরের স্টেটমেন্ট এর ফলাফল?', NULL, '১ ২ ৩ ৪ ৫ ৬ ৭', '১ ৩ ৫ ৭', '২ ৪ ৬ ৮', '১ ২ ৩ ৪ ৫ ৬ ৭ ৮', '2', NULL, NULL, '2020-06-30 06:23:15', '2020-06-30 06:23:15'),
(351, 29, 'URL দ্বারা কোনটি প্রকাশ করা হয়?', NULL, 'ইন্টারনেট', 'ডোমেইন নেম', 'ইয়াহু', 'ফেসবুক', '2', NULL, NULL, '2020-06-30 06:29:11', '2020-06-30 06:29:11'),
(352, 29, 'URL এর তৃতীয় অংশের নাম কি?', NULL, 'প্রোটোকল', 'পাথ', 'প্যারামিটার', 'হোস্টনেম', '2', NULL, NULL, '2020-06-30 06:30:07', '2020-06-30 06:30:07'),
(353, 29, 'কোন ওয়েবসাইটকে ইন্টারনেটে যে কম্পিউটার রাখা হয় তাকে কী বলা হয়?', NULL, 'হোম কম্পিউটার', 'মাদার কম্পিউটার', 'হাউট কম্পিউটার', 'হোস্ট কম্পিউটার', '4', NULL, NULL, '2020-06-30 06:32:08', '2020-06-30 06:32:08'),
(354, 29, 'আইপি ডেটা নেটওয়ার্ক কোনটি?', 59, '1G', '2G', '3G', '4G', '4', NULL, NULL, '2020-06-30 06:33:26', '2020-06-30 06:33:26'),
(355, 29, 'এইচটিএমএল এর চিহ্ন কোনটি?', NULL, '<>', '{}', '()', '[]', '1', NULL, NULL, '2020-06-30 06:38:28', '2020-06-30 06:38:28'),
(356, 29, 'নিচের কোনটি ফাকা ট্যাগ?', 59, '< th >', '< td >', '< br >', '< em >', '3', NULL, NULL, '2020-06-30 06:42:49', '2020-06-30 06:42:49'),
(357, 29, 'Link ট্যাগ কোনটি?', 103, '< o1> ..............</o1>', '< li> ...............</li>', '< li> ...............</li>', '< q > ..............</q>', '3', NULL, NULL, '2020-06-30 06:44:36', '2020-06-30 06:44:36'),
(358, 29, 'ইন্টারনেটের মাধ্যমে পরস্পরের সাথে যুক্ত হাইপার টেক্সট ডকুমেন্ট কে কি বলে?', NULL, 'ওয়ার্ল্ড ওয়াইড ওয়েব', 'নেটওয়ার্কিং', 'ব্রাউজিং', 'প্রোগ্রামিং', '1', NULL, NULL, '2020-06-30 07:04:53', '2020-06-30 07:04:53'),
(359, 29, 'কোনটি ওয়েব ব্রাউজার?', NULL, 'গুগল', 'ইয়াহু', 'মজিলা', 'বিং', '3', NULL, NULL, '2020-06-30 07:07:08', '2020-06-30 07:07:08'),
(360, 29, 'কোন ওয়েবসাইটকে যেখানে হোস্ট করা হয় তার নাম কী?', NULL, 'হোম পেজ', 'ওয়েব সার্ভার', 'হোস্টার', 'মাদার কম্পিউটার', '2', NULL, NULL, '2020-06-30 07:08:16', '2020-06-30 07:08:16'),
(361, 29, 'এইচটিএমএল হলো-', NULL, 'ওয়েবব্রাউজার', 'মার্কআপ ল্যাঙ্গুয়েজ', 'মেশিন ল্যাঙ্গুয়েজ', 'ওয়েবপেজ তৈরীর টুলস', '2', NULL, NULL, '2020-06-30 07:09:34', '2020-06-30 07:09:34'),
(362, 29, 'হেডিং ট্যাগ কি?', 25, '2', '4', '6', '8', '3', NULL, NULL, '2020-06-30 07:10:37', '2020-06-30 07:10:37'),
(363, 29, 'HTML এ বাংলা ফন্ট ব্যবহারের জন্য কোন এট্রিবিউট প্রয়োজন?', NULL, 'font', 'href', 'face', 'src', '3', NULL, NULL, '2020-06-30 07:11:57', '2020-06-30 07:11:57'),
(364, 29, 'HTML এ সবচেয়ে ছোট আকারের Heading প্রদর্শনের জন্য নিচের', NULL, '< h1 >', '< h2 >', '< h5 >', '< h6 >', '4', NULL, NULL, '2020-06-30 07:13:27', '2020-06-30 07:13:27'),
(365, 29, 'HTML এ লিংক সিনটেক্স হলো- \r\n< a href = “url” > Link text </a >\r\nএখানে, a href এর অর্থ হচ্ছে,', 49, 'a hot reference', 'a hyperlink replace', 'a hyperlink reference', 'a home reference', '3', NULL, NULL, '2020-06-30 07:51:51', '2020-06-30 07:51:51'),
(366, 29, 'HTTP এর পূর্ণরূপ-', 49, 'Higher Text Transfer Protocol', 'Hyper Text Transfer Protocol', 'Higher Transfer Text Protocol', 'Hyper Transfer Text Protocol', '2', NULL, NULL, '2020-06-30 07:53:56', '2020-06-30 07:53:56'),
(367, 29, 'ওয়েব পেইজ ডিজাইন কোনটি?', 60, 'ওয়বেসার্ভারে তথ্য রাখা', 'HTML ডকুমেন্ট তৈরী', 'বিশ্বব্যাপী নেটওয়ার্ক', 'ডোমেইন রেজিস্ট্রেশন', '4', NULL, NULL, '2020-07-01 03:06:07', '2020-07-01 03:06:07'),
(368, 29, 'http://www.yahoo.com এর সর্বশেষ অংশের নাম কি?', 60, 'প্রোটোকল', 'ডোমেইন নেইম', 'ফাইল প্রকৃতি', 'ডোমেইন প্রকৃতি', '4', NULL, NULL, '2020-07-01 03:07:53', '2020-07-01 03:07:53'),
(369, 29, 'একটি আইপি অ্যাড্রেসকে প্রকাশের জন্য মোট কয়টি অকটেড প্রয়োজন?', 38, '২', '৪', '৮', '৩২', '1', NULL, NULL, '2020-07-01 03:09:45', '2020-07-01 03:09:45'),
(370, 29, 'ওপেনিং ট্যাগ থেকে ক্লোজিং ট্যাগ পর্যন্ত সকল বিচ্ছুকে কি বলে?', 38, 'ট্যাগ', 'হেড', 'বডি', 'HTML উপাদান', '4', NULL, NULL, '2020-07-01 03:11:14', '2020-07-01 03:11:14'),
(371, 29, 'Google.com কি?', 82, 'Browser', 'Search Engine', 'Protocol', 'E-mail address', '2', NULL, NULL, '2020-07-01 03:12:44', '2020-07-01 03:12:44'),
(372, 29, 'ওপেনিং ট্যাগ থেকে ক্লোজিং ট্যাগ পর্যন্ত সকল বিচ্ছুকে কি বলে?', 82, 'টাইটেল', 'হেড', 'বডি', 'কনটেন্ড', '4', NULL, NULL, '2020-07-01 03:14:22', '2020-07-01 03:14:22'),
(373, 29, 'HTML ট্যাগের চিহ্ন কোনটি?', 82, '[]', '{}', '()', '<>', '4', NULL, NULL, '2020-07-01 03:15:56', '2020-07-01 03:15:56'),
(374, 29, 'Table Data এর ট্যাগ কোনটি?', 126, '<tr>', '<dt>', '<td>', '<itr>', '3', NULL, NULL, '2020-07-01 03:17:51', '2020-07-01 03:17:51'),
(375, 29, 'কোন html tag এর ক্লোজিং ট্যাগ থাকে না?', 71, '<hi>', '<img>', '<tr>', '<br>', '4', NULL, NULL, '2020-07-01 03:19:30', '2020-07-01 03:19:30'),
(376, 29, 'কোন html ট্যাগটি ড্রপ ডাউন বক্স তৈরীতে ব্যবহৃত হয়?', 71, '<option>', '<frame>', '<select>', '<input>', '1', NULL, NULL, '2020-07-01 03:21:31', '2020-07-01 03:21:31'),
(377, 29, 'ওয়েব পেইজে 1000 বাই ৮০০ পিক্সেল mahire.ipg ইমেজটি যুক্ত করার জন্য <imgsrc=\'nature.ipg\'> এর সাথে কোন নির্দেশনা যুক্ত হবে?', 71, 'width=\"1000\" height=\"800\"', 'Pixelw “1000”pixeth=“800”', 'w=“1000”h=“800”', 'wid = “100” hei = “800”', '1', NULL, NULL, '2020-07-01 03:35:51', '2020-07-01 03:35:51'),
(378, 29, 'নিচের কোনটি ওয়েবপৃষ্টার পূর্ণ ঠিকানা?', 60, '< a href = “www” link text < / a >', '< a href = ”url”> link text </a>', '< a href = “www.url” > link text < / a >', '< a href = “www link.com” < / a >', '2', NULL, NULL, '2020-07-01 03:37:27', '2020-07-01 03:37:27'),
(379, 29, 'ওয়েব সাইটের হায়ারারকিক্যাল কাঠামো কি?', 104, 'হোমপেজ নির্ভর ওয়েবসাইট', 'প্রতি পেজের সাথে লিংক', 'ওয়েবভিত্তিক যোগাযোগ', 'দুটি পেজের মধ্যে লিংক', '1', NULL, NULL, '2020-07-01 03:39:10', '2020-07-01 03:39:10'),
(380, 29, 'ওয়েব পেজ তৈরীতে কোন ভাষা ব্যবহৃত হয়?', 104, 'PYTHON', 'HTML', 'COBCt', 'FORTRAN', '2', NULL, NULL, '2020-07-01 03:42:19', '2020-07-01 03:42:19'),
(381, 29, 'এইচটিএমএল এ <p> ও </p> ট্যাগ ব্যবহার করা হয়-', NULL, 'প্যারাগ্রাফ তৈরির জন্য', 'নতুন পেজ তৈরির জন্য', 'লেখা বোল্ড করার জন্য', 'প্রোগ্রাম শুরু করার জন্য', '1', NULL, NULL, '2020-07-01 03:43:55', '2020-07-01 03:43:55'),
(382, 29, 'HTML ফাইল নামের এক্সটেনশন হলো-', NULL, '.html', '.doc', '.txt', '.jpeg', '1', NULL, NULL, '2020-07-01 03:44:56', '2020-07-01 03:44:56'),
(383, 29, 'এইচটিএমএল এ <b> ও  </b> ট্যাগ ব্যবহার করা হয়-', NULL, 'প্যারাগ্রাফ তৈরীর জন্য', 'নতুন পেজ তৈরীর জন্য', 'লেখা বোল্ড করার জন্য', 'কোনটি নয়', '3', NULL, NULL, '2020-07-01 03:46:41', '2020-07-01 03:46:41'),
(384, 29, 'এইচটিএমএল এর উদ্ভাবক হলেন-', NULL, 'টিম বার্নার্স লি', 'মার্ক জুকারবার্গ', 'স্টিভ জবস', 'মার্শাল ম্যাকলুহান', '1', NULL, NULL, '2020-07-01 03:47:47', '2020-07-01 03:47:47'),
(385, 29, 'বাকা অক্ষরে মুদ্রিত করার জন্য ব্যবহার করা হয়-', NULL, '<em>', '<italize>', '<it>', '<i>', '4', NULL, NULL, '2020-07-01 03:48:56', '2020-07-01 03:48:56'),
(386, 29, 'ইন্টারনেটকে সংক্ষেপে বলা হয়-', NULL, 'nt', 'net', 'inet', 'int', '2', NULL, NULL, '2020-07-01 03:49:40', '2020-07-01 03:49:40'),
(387, 29, 'দুটি ওয়েবপেজের মধ্যে যোগাযোগ স্থাপনের জন্য কী ব্যবহার করতে হয়?', NULL, 'হাইপার লিংক', 'এলিমেন্ট', 'সার্চ ইঞ্জিন', 'ব্রাউজার', '1', NULL, NULL, '2020-07-01 03:51:18', '2020-07-01 03:51:18'),
(388, 29, 'কোনটি থেকে ওয়েবসাইটের ভিতরে থাকা বিষয় সম্পর্কে প্রাথমিক ধারনা পাওয়া যায়?', NULL, 'ল্যাংগুয়েজ', 'হোমপেজ', 'মেইন পেজ', 'সাবকন্টেন্ট', '2', NULL, NULL, '2020-07-01 03:52:27', '2020-07-01 03:52:27'),
(389, 29, 'প্রতিটি সাইটের স্বতন্ত্র নামকে কি বলে?', NULL, 'ফটোশপ', 'ডোমেইন', 'HTML', 'সাইট ডিজাইন', '2', NULL, NULL, '2020-07-01 03:53:36', '2020-07-01 03:53:36'),
(390, 29, 'কোনটি সঠিক URL?', NULL, 'www.abc-com/xyz', 'www.abc.com\\xyz', 'www.abc-com\\xyz', 'www.abc.com/xyz', '4', NULL, NULL, '2020-07-01 03:54:54', '2020-07-01 03:54:54'),
(391, 29, 'টেবিল এর হেডিং এর জন্য নিচের কোন ট্যাগটি ব্যবহৃত হয়?', NULL, '<tr>', '<td>', '<th>', '<br>', '3', NULL, NULL, '2020-07-01 03:56:04', '2020-07-01 03:56:04'),
(392, 29, 'টেবিল এর রোঁ এর জন্য নিচের কোন ট্যাগটি ব্যবহৃত হয়?', NULL, '<tr>', '<td>', '<th>', '<br>', '1', NULL, NULL, '2020-07-01 03:57:27', '2020-07-01 03:57:27'),
(393, 29, 'টেবিল এর সেল এর জন্য কোন ট্যাগটি ব্যবহৃত হয়?', NULL, '<tr>', '<td>', '<th>', '<br>', '1', NULL, NULL, '2020-07-01 03:58:48', '2020-07-01 03:58:48'),
(394, 29, 'HTML এ ফর্ম তৈরী করার জন্য ব্যবহৃত ট্যাগ-', NULL, '<f>', '<frm>', '<form>', '<fm>', '3', NULL, NULL, '2020-07-01 07:28:27', '2020-07-01 07:28:27'),
(395, 29, 'HTML এর ফর্মে ড্রপ-ডাউন বক্স তৈরী করার জন্য ব্যবহৃত ট্যাগ-', NULL, '<option>', '<drop>', '<dd>', '<down>', '1', NULL, NULL, '2020-07-01 07:31:38', '2020-07-01 07:31:38'),
(396, 29, 'HTML এর ফর্মে অপশন গ্রুপ তৈরী করার জন্য ব্যবহৃত ট্যাগ-', NULL, '<option>', '<optgroup>', '<og>', '<ogroup>', '2', NULL, NULL, '2020-07-01 07:32:52', '2020-07-01 07:32:52'),
(397, 29, 'ডোমেইন নাম হলো-', 81, 'ওয়েব সাইটের একটি স্বতন্ত্র নাম', 'সার্ভারের নাম', 'ওয়েব ফাইলের নাম', 'ফোল্ডারের নাম', '1', NULL, NULL, '2020-07-01 07:37:44', '2020-07-01 07:37:44'),
(398, 29, 'HTML এর উদ্ভাবক হলেন-', 81, 'টিম বার্নার্সলি', 'স্টিভ জবস', 'মার্ক জুকারবার্গ', 'বিল গেটস', '1', NULL, NULL, '2020-07-01 07:40:23', '2020-07-01 07:40:23'),
(399, 29, 'ফন্টের নাম পরিবর্তন করতে কোন অ্যাট্রিবিউট ব্যবহার করা হয়?', 37, 'size', 'font', 'face', 'name', '3', NULL, NULL, '2020-07-01 07:46:47', '2020-07-01 07:46:47'),
(400, 29, 'নিচের কোন হেডিং ট্যাগের সাইজ সবচেয়ে ছোট?', 37, 'h1', 'h3', 'h5', 'h6', '4', NULL, NULL, '2020-07-01 07:49:05', '2020-07-01 07:49:05'),
(401, 29, 'টেবিলের সেলের ব্যাকগ্রাউন্ড কালার কোন ট্যাগে হলুদ হবে?', 114, '< table bg color = \"Yellow\">', '< tr bg color = \"Yellow\">', '<td bg color = \"Yellow\">', '<tr td bg color = \"Yellow\">', '3', NULL, NULL, '2020-07-01 07:51:53', '2020-07-01 07:51:53'),
(402, 29, 'একটি পেজের সাথে অন্য পেজের সংযোগকে HTML ভাষায় কি বলে?', 114, 'Connection', 'Hyperlink', 'Link', 'Addition', '2', NULL, NULL, '2020-07-01 07:53:36', '2020-07-01 07:53:36'),
(403, 29, 'ISP এর পূর্ণ নাম কি?', 70, 'Internet super power', 'Internet Sever Provider', 'Internet Server Programme', 'Internet Service Provider', '4', NULL, NULL, '2020-07-01 07:58:54', '2020-07-01 07:58:54'),
(404, 29, 'ওয়েব পেজের এড্রেসকে কি বলে?', 70, 'URL', 'HTTP', 'HTML', 'WWW', '1', NULL, NULL, '2020-07-01 08:00:19', '2020-07-01 08:00:19'),
(405, 29, 'HTML এর বৈশিষ্ট্য হলো-', 125, 'এটি ইউজার ফ্রেন্ডলি ওপেন টেকনোলজি', 'নিরাপত্তা ব্যবস্থা উন্নত', 'HTML নিজেকে বর্ধিত করার ক্ষমতা রাখে', 'কোড লিখতে সিনট্যাক্স মনে রাখতে হয়', '1', NULL, NULL, '2020-07-01 08:04:48', '2020-07-01 08:04:48'),
(406, 29, 'যে ট্যাগের শুরু আছে কিন্তু বিষয়বস্তু ও শেষ থাকে না তাকে বলে-', 125, 'অ্যাট্রিবিউট', 'হেড', 'এম্পটি', 'কন্টেইনার', '3', NULL, NULL, '2020-07-01 08:06:17', '2020-07-01 08:06:17'),
(407, 29, 'হাসিব অনেক সময় নিয়ে একটি মাদরাসার ওয়েবসাইট তৈরি করলেন। ওয়েবসাইটটিতে মাদরাসার যাবতীয় তথ্য বিন্যস্ত করে ছবির জন্য \'নতুন অ্যালবাম\' নামে একটি পেজ বানালেন। হাসিবের কাজকে কি বলা হয়?', 125, 'ওয়েব ডিজাইনিং', 'ওয়েব হোস্টিং', 'ওয়েব লিংকিং', 'ওয়েব পাবলিশিং', '1', NULL, NULL, '2020-07-01 08:09:23', '2020-07-01 08:09:23'),
(408, 29, 'কোনটি ওয়েব ব্রাউজার?', 125, 'Skype', 'Viber', 'Chrome', 'Facebook', '3', NULL, NULL, '2020-07-01 08:10:26', '2020-07-01 08:10:26'),
(409, 29, '.edu দ্বারা কোন ধরনের ডোমেনকে বুঝায়?', 25, 'সামরিক', 'সাংগঠনিক', 'শিক্ষামূলক', 'ব্যবসায়িক', '3', NULL, NULL, '2020-07-01 08:11:48', '2020-07-01 08:11:48'),
(410, 30, 'যুক্তি অ্যালজেবরার উদ্ভাবক কে?', NULL, 'জর্জ বুল', 'নিউটন', 'প্যাসকেল', 'বিল গেটস', '1', NULL, NULL, '2020-07-02 03:14:38', '2020-07-02 03:14:38'),
(411, 30, 'জর্জ বুল কত সালে বুলিয়ান অ্যালজেবরা উদ্ভাবন করেন?', NULL, '১৭৫৪', '১৮৪৭', '১৮৫৬', '১৭৫৬', '2', NULL, NULL, '2020-07-02 03:15:36', '2020-07-02 03:15:36'),
(412, 30, 'বুলিয়ান অ্যালজেবরায় প্রত্যেক চলকের মান কয়টি থাকে?', NULL, '১টি', '২টি', '৩টি', '৪টি', '2', NULL, NULL, '2020-07-02 03:16:22', '2020-07-02 03:16:22'),
(413, 30, 'বুলিয়ান অ্যালজেবরার ভিত্তি হলো-', NULL, 'High-low', 'On-Off', 'True-False', 'yes-no', '3', NULL, NULL, '2020-07-02 03:18:40', '2020-07-02 03:18:40'),
(414, 30, 'বুলিয়ান অ্যালজেবরার মৌলিক কাজ-', NULL, '১টি', '২টি', '৩টি', '৪টি', '2', NULL, NULL, '2020-07-02 03:19:21', '2020-07-02 03:19:21'),
(415, 30, 'ডিজিটাল ইলেক্ট্রনিক্স সার্কিটে +5 ভোল্ট নির্দেশ করে-', 126, '1', '0', '10', '101', '1', NULL, NULL, '2020-07-02 03:20:57', '2020-07-02 03:20:57'),
(416, 30, 'ডিজিটাল ইলেক্ট্রনিক্স সার্কিটে কোন ভোল্টকে সংজ্ঞায়িত করা হয়নি?', NULL, '0-0.8 Volt', '0.8 -2 Volt', '1-2 Volt', '2-5 Volt', '2', NULL, NULL, '2020-07-02 03:22:15', '2020-07-02 03:22:15'),
(417, 30, 'বাইনারি ডিজিট 1 দ্বারা কম্পিউটারে ইলেক্ট্রনিক সার্কিটে কত ভোল্টের সমতুল্য ধরা হয়?', NULL, '1-2 Volt', '2-5 Volt', '3-5 Volt', '4-5 Volt', '2', NULL, NULL, '2020-07-02 03:23:38', '2020-07-02 03:23:38'),
(418, 31, 'A + B = (A + B) (A + C) উপপাদ্যটি হলো-', 103, 'বিনিময়', 'অনুষঙ্গ', 'মৌলিক', 'বিভাজন', '4', NULL, NULL, '2020-07-02 03:27:11', '2020-07-02 03:27:11'),
(419, 31, 'কোনটি মৌলিক উপপাদ্য?', 25, 'A + 1 = A', 'A + 0 = A', 'A + A1 = 0', 'A + A = 1', '2', NULL, NULL, '2020-07-02 03:29:51', '2020-07-02 03:29:51'),
(420, 32, 'লজিক গেইটে সর্বনিম্ন ইনপুটের সংখ্যা কতটি?', NULL, '১টি', '২টি', '৩টি', '৪টি', '1', NULL, NULL, '2020-07-02 03:35:58', '2020-07-02 03:35:58'),
(421, 32, 'লজিক গেইট কত প্রকার?', NULL, '১', '২', '৩', '৪', '2', NULL, NULL, '2020-07-02 03:36:33', '2020-07-02 03:36:33'),
(422, 32, 'মৌলিক লজিক গেইট কয়টি?', NULL, '১টি', '২টি', '৩টি', '৪টি', '3', NULL, NULL, '2020-07-02 03:37:14', '2020-07-02 03:37:14'),
(423, 32, 'যৌগিক লজিক গেইট কয়টি?', NULL, '২', '৩', '৪', '৫', '3', NULL, NULL, '2020-07-02 03:38:28', '2020-07-02 03:38:28'),
(424, 32, 'কোনটি মৌলিক লজিক গেইট?', NULL, 'NAND', 'NOR', 'OR', 'X-OR', '3', NULL, NULL, '2020-07-02 03:39:58', '2020-07-02 03:39:58'),
(425, 32, 'কোনটি যৌগিক লজিক গেইট?', NULL, 'AND', 'OR', 'NOT', 'NOR', '4', NULL, NULL, '2020-07-02 03:40:43', '2020-07-02 03:40:43'),
(426, 32, 'দুই বা ততোধিক মৌলিক গেইটের সমন্বয়ে তৈরী হয়-', NULL, 'মৌলিক গেইট', 'যৌগিক গেইট', 'সার্বজনীন গেইট', 'বিশেষ গেইট', '2', NULL, NULL, '2020-07-02 03:42:13', '2020-07-02 03:42:13'),
(427, 32, 'সার্বজনীন গেইট কোনটি?', NULL, 'AND', 'NAND', 'XOR', 'X-NOR', '2', NULL, NULL, '2020-07-02 03:42:56', '2020-07-02 03:42:56'),
(428, 33, 'OR গেইটের কাজ হলো-', NULL, '+', '-', '*', '/', '1', NULL, NULL, '2020-07-02 03:44:34', '2020-07-02 03:44:34'),
(429, 33, 'OR গেইটের ক্ষেত্রে কখন আলো জ্বলবে না?', NULL, 'A=0, B=0', 'A=0, B=1', 'A=1, B=0', 'A=1, B=1', '1', NULL, NULL, '2020-07-02 03:46:22', '2020-07-02 03:46:22'),
(430, 33, 'F = (A+B) + C সমীকরণটি কোন গেইট নির্দেশ করে?', NULL, 'AND', 'OR', 'NOT', 'NOR', '2', NULL, NULL, '2020-07-02 03:47:49', '2020-07-02 03:47:49'),
(431, 33, 'NOR গেইটের আউটপুট কোনটির আউটপুটের বিপরীত?', NULL, 'AND', 'OR', 'XOR', 'X-NOR', '1', NULL, NULL, '2020-07-02 03:48:36', '2020-07-02 03:48:36'),
(432, 33, 'NOR গেইটের আউটপুটকে NOT গেইটের মধ্য দিয়ে প্রবেশ করালে কোন গেইট পাওয়া যায়?', NULL, 'Y-OR', 'X-NOR', 'OR', 'AND', '3', NULL, NULL, '2020-07-02 03:49:57', '2020-07-02 03:49:57'),
(433, 33, 'যদি তিন ইনপুট OR গেইটের আউটপুট 0 করা প্রয়োজন হয়, তাহলে কোনটি প্রয়োগ করতে হবে?', 114, 'সকল ইনপুট শূন্য করতে হবে', 'সকল ইনপুট 1 করতে হবে', 'যে কোন একটি ইনপুট ০(শূন্য)  করতে হবে', 'যে কোন একটি ইনপুট 1 করতে হবে', '1', NULL, NULL, '2020-07-02 03:52:44', '2020-07-02 03:52:44'),
(434, 34, 'AND গেইট এ A ও B এর মান 0 হলে আউটপুট কত?', NULL, '1', '01', '10', '0', '4', NULL, NULL, '2020-07-02 03:55:00', '2020-07-02 03:55:00'),
(435, 34, 'AND গেইটের কাজ হলো-', NULL, '+', '-', '*', '/', '3', NULL, NULL, '2020-07-02 03:55:36', '2020-07-02 03:55:36'),
(436, 34, 'AND গেইটের ক্ষেত্রে কখন আলো জ্বলবে?', NULL, 'A=0,B=0', 'A=0,B=1', 'A=1,B=0', 'A=1,B=1', '4', NULL, NULL, '2020-07-02 03:57:03', '2020-07-02 03:57:03'),
(437, 34, 'X=ABC সমীকরণটি কোন গেইট নির্দেশ করে?', NULL, 'AND', 'OR', 'NOT', 'NOR', '1', NULL, NULL, '2020-07-02 03:58:12', '2020-07-02 03:58:12'),
(438, 34, 'NOR গেটের আউটপুট কোনটির আউটপুটের বিপরীত?', NULL, 'OR', 'X-OR', 'AND', 'X-NOR', '3', NULL, NULL, '2020-07-02 03:59:35', '2020-07-02 03:59:35'),
(439, 34, 'NAND গেইটের আউটপুটকে NOT গেইটের মধ্য দিয়ে প্রবেশ করলে কোন গেইট পাওয়া যায়?', NULL, 'Y-OR', 'X-NOR', 'OR', 'AND', '4', NULL, NULL, '2020-07-02 04:01:02', '2020-07-02 04:01:02'),
(440, 34, 'AND গেইট আউটপুটে ১ পেতে হলে-', NULL, 'সবগুলো ইনপুট ০ হবে', 'যে কোনটি ইনপুট ০ হবে', 'সবগুলো ইনপুট ১ হবে', 'সর্বাবস্থাতেই আউটপুট ১হবে', '3', NULL, NULL, '2020-07-02 04:02:44', '2020-07-02 04:02:44'),
(441, 35, 'নিচের কোনটি মৌলিক গেইট?', 82, 'NOT', 'NOR', 'NAND', 'X-NOR', '1', NULL, NULL, '2020-07-02 04:09:22', '2020-07-02 04:09:22'),
(442, 35, 'কোন লজিক গেইটের ইনপুট এবং আউটপুট লাইন সমান থাকে?', 59, 'AND', 'OR', 'NOT', 'NOR', '3', NULL, NULL, '2020-07-02 04:10:50', '2020-07-02 04:10:50'),
(443, 35, 'কোন গেইটে একটি আউটপুট এবং একটি ইনপুট থাকে?', NULL, 'OR', 'AND', 'NOT', 'NAND', '3', NULL, NULL, '2020-07-02 04:12:42', '2020-07-02 04:12:42'),
(444, 35, 'ইনভারটার হিসেবে কাজ করে কোনটি?', NULL, 'NOR', 'NOT', 'NAND', 'AND', '2', NULL, NULL, '2020-07-02 04:13:27', '2020-07-02 04:13:27'),
(445, 35, 'কোন লজিক গেইটের ইনপুট ও আউটপুটের সংখ্যা সমান?', 125, 'AND', 'NOT', 'OR', 'NOR', '2', NULL, NULL, '2020-07-02 04:15:07', '2020-07-02 04:15:07'),
(446, 35, 'নিচের কোন লজিক গেইটের আউটপুট ইনপুটের বিপরীত?', 38, 'AND', 'OR', 'NOT', 'X-OR', '3', NULL, NULL, '2020-07-02 04:16:59', '2020-07-02 04:16:59'),
(447, 35, 'NAND গেইট তৈরীতে কোন গেইট ব্যবহৃত হয়?', NULL, 'NOR + NOT', 'OR + NOT', 'AND + NOT', 'X_OR_NOT', '3', NULL, NULL, '2020-07-02 04:19:17', '2020-07-02 04:19:17'),
(448, 36, 'সার্বজনীন গেইট কোনটি?', 104, 'AND', 'OR', 'NOR', 'NOT', '3', NULL, NULL, '2020-07-02 04:21:45', '2020-07-02 04:21:45'),
(449, 36, 'সার্বজনীন গেইট কোনটি?', 126, 'AND', 'OR', 'NOR', 'NOT', '3', NULL, NULL, '2020-07-02 04:21:45', '2020-07-02 04:21:45'),
(450, 36, 'সার্বজনীন গেইট কোনটি?', NULL, 'AND', 'OR', 'NAND', 'NOT', '3', NULL, NULL, '2020-07-02 04:23:06', '2020-07-02 04:23:06'),
(451, 36, 'F = AB + C লজিক ফাংশনটি কোন গেইটের মাধ্যমে এককভাবে বাস্তবায়ন করা যাবে?', NULL, 'NAND', 'OR', 'XOR', 'AND', '1', NULL, NULL, '2020-07-02 04:24:15', '2020-07-02 04:24:15'),
(452, 37, 'কোন সর্বোচ্চ ইনপুটের থেকে চারটি আউটপুট পাওয়া যায়?', 26, 'এনকোডার', 'ডিকোডার', 'রেজিস্টার', 'কাউন্টার', '1', NULL, NULL, '2020-07-02 04:26:20', '2020-07-02 04:26:20'),
(453, 37, '১৬ লাইন ইনকোডার এর ক্ষেত্রে OUTPUT লাইন কয়টি হবে?', 82, '2', '3', '4', '8', '3', NULL, NULL, '2020-07-02 04:27:51', '2020-07-02 04:27:51'),
(454, 37, 'যে লজিক বর্তনী আলফা নিউমেরিক ক্যারেক্টারকে বাইনারি কোডে পরিবর্তন করে তাকে কি বলে?', 103, 'রেজিস্টার', 'এনকোডার', 'ডিকোডার', 'কাউন্টার', '2', NULL, NULL, '2020-07-02 04:30:16', '2020-07-02 04:30:16'),
(455, 37, 'কোন সার্কিটের সাহায্যে ডেটাকে কম্পিউটারের বোধগম্য ভাষায় রূপান্তর করা যায়?', 71, 'রেজিস্টার', 'কাউন্টার', 'এনকোডার', 'ডিকোডার', '3', NULL, NULL, '2020-07-02 04:32:07', '2020-07-02 04:32:07'),
(456, 37, 'ডিকোডারের চারটি ইনপুট এর সাহায্যে কয়টি আউটপুট পাওয়া যায়?', NULL, '২', '৪', '৮', '১৬', '4', NULL, NULL, '2020-07-02 04:33:11', '2020-07-02 04:33:11'),
(457, 37, '৬ লাইন Decoder এর ক্ষেত্রে Output লাইন কয়টি হবে?', 82, '৮', '১৬', '৩২', '৬৪', '4', NULL, NULL, '2020-07-02 04:34:32', '2020-07-02 04:34:32'),
(458, 37, '১৬ইনপুট বিশিষ্ট এনকোডারের আউটপুট সংখ্যা কতটি হবে?', 114, '২', '৩', '৪', '৫', '3', NULL, NULL, '2020-07-02 05:02:34', '2020-07-02 05:02:34'),
(459, 37, 'একটি ডিকোডারের আউটপুট ৩২ পেতে চাইলে, ইনপুট কত দিতে হবে?', NULL, '৫', '৬', '৩', '২', '1', NULL, NULL, '2020-07-02 05:03:23', '2020-07-02 05:03:23'),
(460, 37, 'ডিকোডারের ইনপুট সংখ্যা ৪হলে আউটপুট হবে', 37, '৪', '৮', '১৬', '৩২', '3', NULL, NULL, '2020-07-02 05:04:51', '2020-07-02 05:04:51'),
(461, 37, 'ডেটা ট্রান্সফফারের ভিত্তিতে রেজিস্টারকে কত ভাগে ভাগ করা যায়?', NULL, '২', '৩', '৪', '৫', '2', NULL, NULL, '2020-07-02 05:05:54', '2020-07-02 05:05:54'),
(462, 37, 'প্রদানকৃত ইনপুট পালসের সংখ্যা গুনতে পারে এমন একটি সিকুয়েন্সিয়াল সার্কিটকে কি বলে?', 125, 'রেজিস্টার', 'গেইট', 'চলক', 'কাউন্টার', '4', NULL, NULL, '2020-07-02 05:07:56', '2020-07-02 05:07:56'),
(463, 37, 'নিম্নের কোনটিতে কাউন্টার ব্যবহৃত হয় না?', NULL, 'কম্পিউটার', 'ডিজিটাল ঘড়িতে', 'ব্যাংকের টাকা তোলার লাইনে', 'কীবোর্ডে', '4', NULL, NULL, '2020-07-02 05:09:01', '2020-07-02 05:09:01'),
(464, 38, 'ডেটা কমিউনিকেশন কী?', 60, 'দুইটি ডিভাইস এর মধ্যে তথ্য বিনিময়', 'মাধ্যমহীন তারের প্রবাহ', 'শুধুমাত্র তারযুক্ত তথ্যের প্রবাহ', 'শুধুমাত্র কম্পিউটার নির্ভর যোগাযোগ', '1', NULL, NULL, '2020-07-02 11:55:43', '2020-07-02 11:55:43'),
(465, 38, 'কোনটি ট্রান্সমিশন সিস্টেমের উপাদান?', NULL, 'ডিভাইস', 'জিপিএস', 'রিসিভার', 'পার্সোনাল ডিজিটাল', '3', NULL, NULL, '2020-07-02 11:57:05', '2020-07-02 11:57:05'),
(466, 38, 'ট্রান্সমিশন সিস্টেম থেকে ডেটা সিগন্যাল গ্রহণ করা কার কাজ?', NULL, 'সেন্ডারের কাজ', 'রিসিভারের কাজ', 'মডেমের কাজ', 'সিগন্যালের কাজ', '3', NULL, NULL, '2020-07-02 11:58:17', '2020-07-02 11:58:17'),
(467, 38, 'ফটোডিটেক্টর এর কাজ কি?', NULL, 'অ্যানালগ সিগন্যাল কে ডিজিটাল সিগন্যাল এ রূপান্তর করা', 'ডিজিটাল সিগন্যাল কে অ্যানালগ সিগন্যাল এ রূপান্তর করা', 'বিদ্যুৎ শক্তিকে আলোক শক্তিতে রূপান্তর করা', 'আলোক শক্তিকে বিদ্যুৎ শক্তিতে রূপান্তর করা', '4', NULL, NULL, '2020-07-02 12:00:10', '2020-07-02 12:00:10'),
(468, 39, 'ব্যান্ডউইথ কি?', 126, 'ডেটা প্রবাহের হার', 'ডেটা প্রবাহের মাধ্যম', 'ডেটা প্রবাহের দিক', 'ডেটা প্রবাহের পদ্ধতি', '1', NULL, NULL, '2020-07-02 12:08:00', '2020-07-02 12:08:00'),
(469, 39, 'bps এর পূর্ণরূপ কি?', 81, 'bit per second', 'byte per second', 'binary per second', 'bit per system', '1', NULL, NULL, '2020-07-02 12:09:26', '2020-07-02 12:09:26'),
(470, 39, 'ডেটা স্থানান্তরের হারকে বলে-', 81, 'ব্যান্ড মিটার', 'ব্যান্ড উইথ', 'ডেটা ট্রান্সমিশন', 'ডেটা কানেকশন', '2', NULL, NULL, '2020-07-02 12:11:59', '2020-07-02 12:11:59'),
(471, 39, 'ভয়েস ব্যান্ড বেশি ব্যবহৃত হয় কোনটিতে?', NULL, 'টেলিফোন', 'টেলিগ্রাফ', 'স্যাটেলাইট', 'কম্পিউটার', '1', NULL, NULL, '2020-07-02 12:12:58', '2020-07-02 12:12:58'),
(472, 39, 'নিচের কোনটিতে ন্যারোব্যান্ড ব্যবহৃত হয়?', 82, 'টেলিফোন', 'টেলিগ্রাফ', 'স্যাটেলাইট ফোন', 'ওয়াকিটকি', '1', NULL, NULL, '2020-07-02 12:15:17', '2020-07-02 12:15:17'),
(473, 39, 'ভয়েস ব্যান্ড এর সর্বোচ্চ গতি কত?', 104, '6900 bps', '6900 kbps', '9600 bps', '9600 kbps', '3', NULL, NULL, '2020-07-02 12:18:29', '2020-07-02 12:18:29'),
(474, 39, 'ব্রডব্যান্ডের ব্যান্ডউইথ কত?', 49, '১ mbps বা অধিক', '৯৬০০ bps', '৪৫-৩০০ bps এর মধ্যে', '৪৫ bps এর কম', '1', NULL, NULL, '2020-07-02 12:21:51', '2020-07-02 12:21:51'),
(475, 39, 'একটি চ্যানেল দিয়ে ৩ সেকেন্ড এ ৮১০০বিট স্থানান্তরিত হলে তার ব্যান্ডউইথ কত?', NULL, '600 bps', '1800 bps', '2700 bps', '5400 bps', '3', NULL, NULL, '2020-07-02 12:23:19', '2020-07-02 12:23:19'),
(476, 39, 'ন্যারো ব্র্যান্ডে সর্বনিম্ন ডেটা স্পিড কত বিপিএস?', 60, '35', '45', '200', '300', '2', NULL, NULL, '2020-07-02 12:24:46', '2020-07-02 12:24:46'),
(477, 39, 'ন্যারোব্যান্ড টেলিফোন ক্ষেত্রে কত হার্টজফ্রিকুয়েন্সি প্রদান করে থাকে?', NULL, '300-3000', '300-3400', '300-3500', '300-4400', '2', NULL, NULL, '2020-07-02 12:26:18', '2020-07-02 12:26:18'),
(478, 39, 'ডেটা কমিউনিকেশনের গতিকে কয়টি ভাগে ভাগ করা যায়?', 38, '২', '৩', '৪', '৫', '2', NULL, NULL, '2020-07-02 12:27:21', '2020-07-02 12:27:21'),
(479, 39, 'কোনটি সবচেয়ে দ্রুতগতির ডাটা ট্রান্সমিশন?', NULL, 'ব্রড ব্যান্ড', 'ভয়েচব্যান্ড', 'ন্যারো ব্যান্ড', 'লার্জ ব্যান্ড', '1', NULL, NULL, '2020-07-02 12:28:37', '2020-07-02 12:28:37'),
(480, 39, 'ডেটা ট্রান্সমিশনের একককে নিচের কোনটি দ্বারা হিসেব করা হয়?', NULL, 'Spb', 'Kbps', 'bps', 'mbps', '3', NULL, NULL, '2020-07-02 12:29:53', '2020-07-02 12:29:53'),
(481, 39, 'কোথায় ভয়েস ব্যান্ড ব্যবহৃত হয়?', NULL, 'টেলিগ্রাফি', 'ট্যালি প্যাথিতে', 'টেলি কনফারেন্স', 'টেলিফোন', '4', NULL, NULL, '2020-07-02 12:30:50', '2020-07-02 12:30:50'),
(482, 40, 'অ্যাসিনক্রোনাস ডেটা ট্রান্সমিশনের সুবিধা কোনটি?', NULL, 'ব্লক আকারে ডেটা ট্রান্সমিট হয়', 'বেশি ডাটা ট্রান্সমিট হয়', 'প্রাইমারি স্টোরেজ ডিভাইসের প্রয়োজন নেই', 'বিরতিহীনভাবে ডেটা ট্রান্সমিট করে', '3', NULL, NULL, '2020-07-02 12:35:03', '2020-07-02 12:35:03'),
(483, 40, 'নিচের কোন পদ্ধতিতে প্রেরক কম্পিউটার হতে ডেটা গ্রাহক কম্পিউটারে ক্যারেক্টার বাই ক্যারেক্টার ডেটা ট্রান্সমিট হয়?', NULL, 'সিনক্রোনাস ট্রান্সমিশন', 'অ্যাসিনক্রোনাস ট্রান্সমিশন', 'আইসোক্রোনাস ট্রান্সমিশন', 'ট্রান্সমিশন', '2', NULL, NULL, '2020-07-02 12:36:54', '2020-07-02 12:36:54'),
(484, 40, 'নিচের কোন বৈশিষ্ট্যটি অ্যাসিনক্রোনাস ট্রান্সমিশনের বেলায় প্রযোজ্য?', NULL, 'ইনস্টলের খরচ বেশি', 'প্রতিটি বর্ণের সাথে একটি স্টার্ট বিট গ্রহণ করতে হয়', 'প্রেরকের প্রাইমারি স্টোরেজ ডিভাইসের প্রয়োজন হয়', 'ডেটা ট্রান্সমিশনের গতি  কম', '2', NULL, NULL, '2020-07-02 12:41:35', '2020-07-02 12:41:35'),
(485, 40, 'নিচের কোনটি অ্যাসিনক্রোনাস ট্রান্সমিশন বুঝায়?', NULL, 'স্টার্ট/স্টপ ট্রান্সমিশন', 'স্টপ ট্রান্সমিশন', 'স্টার্ট ট্রান্সমিশন', 'লিনিয়ার ট্রান্সমিশন', '1', NULL, NULL, '2020-07-03 03:00:46', '2020-07-03 03:00:46'),
(486, 40, 'অ্যাসিনক্রোনাস ট্রান্সমিশনের সুবিধা হলো-', 25, 'প্রাইমারি স্টোরেজ ডিভাইসের প্রয়োজন হয় না', 'ডেটা ট্রান্সমিশনের গতি বেশি', 'ব্লক আকারে ডেটা প্রেরিত হয়', 'স্যাটেলাইট ব্যবহারে অধিক উপযোগী', '1', NULL, NULL, '2020-07-03 03:07:09', '2020-07-03 03:07:09'),
(487, 41, 'কোনটি একমুখী ডেটা প্রবাহ?', NULL, 'সিনক্রোনাস', 'হাফ-ডুপ্লেক্স', 'আইসোক্রোনাস', 'সিমপ্লেক্স', '4', NULL, NULL, '2020-07-03 03:08:48', '2020-07-03 03:08:48'),
(488, 41, 'কম্পিউটার ও মাল্টিমিডিয়া প্রজেক্টের মধ্যে ডেটা সঞ্চালন মোড কোনটি?', 103, 'সিমপ্লেক্স', 'হাফ-ডুপ্লেক্স', 'ফুল-ডুপ্লেক্স', 'মাল্টিকাস', '1', NULL, NULL, '2020-07-03 03:10:31', '2020-07-03 03:10:31'),
(489, 41, 'ডেটা ট্রান্সমিশন মোড কত প্রকার?', 125, '২', '৩', '৪', '৫', '2', NULL, NULL, '2020-07-03 03:11:42', '2020-07-03 03:11:42'),
(490, 41, 'মোবাইল ফোন কোন পদ্ধতিতে ডেটা কমিউনিকেশন করে?', NULL, 'সিমপ্লেক্স', 'হাফডুপ্লেক্স', 'ফুল ডুপ্লেক্স', 'মাল্টিকাস', '3', NULL, NULL, '2020-07-03 03:12:52', '2020-07-03 03:12:52'),
(491, 41, 'নিচের কোন পদ্ধতিতে প্রেরক কম্পিউটার সব সময় অন্য কম্পিউটারে শুধু ডেটা পাঠায়?', NULL, 'সিমপ্লেক্স', 'ব্রডকাস্ট', 'মাল্টিকাস্ট', 'হাফ-ডুপ্লেক্স', '1', NULL, NULL, '2020-07-03 03:17:37', '2020-07-03 03:17:37'),
(492, 41, 'দুইজন ব্যাক্তি মোবাইলে কথোপকথনের ক্ষেত্রে কোন মোড কাজ করে?', 126, 'ফুল-ডুপ্লেক্স', 'হাফ-ডুপ্লেক্স', 'সিমপ্লেক্স', 'মাল্টিকাস', '1', NULL, NULL, '2020-07-03 03:19:15', '2020-07-03 03:19:15'),
(493, 41, 'সিমপ্লেক্স পদ্ধতির উদাহরণ কোনটি?', NULL, 'মোবাইল', 'ওয়াকিটকি', 'টেলিফোন', 'রেডিও', '4', NULL, NULL, '2020-07-03 03:20:31', '2020-07-03 03:20:31'),
(494, 41, 'নিচের কোনটি সিমপ্লেক্স, হাফ ডুপ্লেক্স ও ফুল ডুপ্লেক্স মোডের নির্দেশক?', NULL, 'মাল্টিকাস মোড', 'ব্রডকাস মোড', 'ইউনিকাস্ট মোড', 'সেমিকাস্ট মোড', '3', NULL, NULL, '2020-07-03 03:24:37', '2020-07-03 03:24:37'),
(495, 41, 'হাফ-ডুপ্লেক্স এর উদাহরণ কোনটি?', NULL, 'রেডিও', 'মোবাইল', 'টিভি', 'ওয়াকিটকি', '4', NULL, NULL, '2020-07-03 03:26:10', '2020-07-03 03:26:10'),
(496, 41, 'কোনটির মাধ্যমে ডেটা একই সাথে দুইদিকে যেতে পারে?', 81, 'Simplex', 'Half-duplex', 'Broadcast', 'Full duplex', '4', NULL, NULL, '2020-07-03 03:28:09', '2020-07-03 03:28:09'),
(497, 41, 'ব্রডকাস্ট মোডের উদাহরণ হলো-', 81, 'টিভি সম্প্রচার', 'ভিডিও কনফারেন্সিং', 'টেলিফোন কথোপকথন', 'SMS প্রেরণ', '1', NULL, NULL, '2020-07-03 03:29:59', '2020-07-03 03:29:59'),
(498, 41, 'গ্রুপ SMS প্রদান হলো -', 70, 'ইউনিকাস্ট', 'মাল্টিকাস্ট', 'ব্রডকাস্ট', 'টেলিকাস্ট', '2', NULL, NULL, '2020-07-03 03:31:43', '2020-07-03 03:31:43'),
(499, 42, 'কোর, ক্লোডিং ও জ্যাকেট দিয়ে নিম্নের কোনটি তৈরী হয়?', NULL, 'কো-এক্সিয়াল', 'অপটিক্যাল ফাইবার', 'টুইস্টেড পেয়ার', 'রাউটার', '2', NULL, NULL, '2020-07-03 03:35:04', '2020-07-03 03:35:04'),
(500, 42, 'টুইস্টেড পেয়ার ক্যাবল এর সাধারণ রং কোনটি?', 104, 'কমলা', 'বাদামী', 'কাল', 'সাদা', '4', NULL, NULL, '2020-07-03 03:36:43', '2020-07-03 03:36:43'),
(501, 42, 'কো-এক্সিয়াল ক্যাবলের ডেটা প্রেরণের সাধারণ হার কত?', 71, '100 * mbps', '200 Mbps', '2 Gbps', '40 Gbps', '2', NULL, NULL, '2020-07-03 03:42:18', '2020-07-03 03:42:18'),
(502, 39, 'নিচের কোনটি কো-এক্স ক্যাবলের তারকে ঘিরে জড়ানো থাকে?', NULL, 'প্লাস্টিকের আবরণ', 'নাইলন সূতার জাল', 'প্লাস্টিক ফোমের ইনসুলেশন', 'ফোমের ইনসুলেশন', '3', NULL, NULL, '2020-07-03 03:48:43', '2020-07-03 03:48:43'),
(503, 42, 'কোনটি কো-এক্সিয়াল ক্যাবলের ডেটা সিগন্যাল কে EMI থেকে রক্ষার জন্য ব্যবহার করা হয়?', NULL, 'মেটালিক ফরেন', 'প্লাস্টিকের জ্যাকেট', 'সলিড কপার ওয়্যার', 'মেটালিক সিল্ড', '4', NULL, NULL, '2020-07-03 04:03:26', '2020-07-03 04:03:26'),
(504, 42, 'কী দিয়ে অপটিকেল ফাইবার ক্যাবল তৈরী?', NULL, 'কাঁচ তন্তু', 'ইস্পাত', 'কপার', 'ফেরাস কোর', '1', NULL, NULL, '2020-07-03 04:04:32', '2020-07-03 04:04:32'),
(505, 42, 'নিচের কোন ক্যাবল এ ডেটা ট্রান্সফার হার সর্বোচ্চ?', 125, 'শিল্ডেড টুইস্টেট পেয়ার ক্যাবল', 'আন-শিল্ডেড টুইস্টেট পেয়ার ক্যাবল', 'কো-এক্সিয়াল ক্যাবল', 'ফাইবার অপটিক্যাল কেবল', '4', NULL, NULL, '2020-07-03 04:06:37', '2020-07-03 04:06:37'),
(506, 42, 'কীভাবে আন্তঃমহাদেশীয় অপটিক্যাল ফাইবার সারা বিশ্বে ছড়িয়ে গেছে?', NULL, 'সমুদ্র তলদেশ দিয়ে', 'বায়ুর মধ্য দিয়ে', 'মাটির নিচ দিয়ে', 'ভু-উপগ্রহের মাধ্যমে', '1', NULL, NULL, '2020-07-03 04:07:56', '2020-07-03 04:07:56'),
(507, 42, 'অপটিক্যাল ফাইবার এর সবচেয়ে ভিতরের অংশ কোনটি?', 126, 'বাফার', 'জ্যাকেট', 'ক্ল্যাডিং', 'কোর', '4', NULL, NULL, '2020-07-03 04:09:22', '2020-07-03 04:09:22'),
(508, 42, 'সর্বোচ্চ গতিতে ডেটা ট্রান্সফার করে কোনটি?', NULL, 'UTP', 'STP', 'কো-এক্সিয়াল ক্যাবল', 'ফাইবার অপটিক ক্যাবল', '4', NULL, NULL, '2020-07-03 04:10:21', '2020-07-03 04:10:21'),
(509, 42, 'কোনটি কো-এক্সিয়াল ক্যাবলের সুবিধা?', NULL, 'টুইস্টেড পেয়ারের চেয়ে গতি কম', 'ডেটা ট্রান্সফার গতি কম', 'ট্রান্সমিশন লস অপেক্ষাকৃত কম', 'সিগন্যাল ট্রান্সমিত অপেক্ষাকৃত কম', '3', NULL, NULL, '2020-07-03 04:11:44', '2020-07-03 04:11:44'),
(510, 42, 'এসটিপি ক্যাবলের বাইরে নিচের কোনটি থাকে?', NULL, 'জ্যাকেট বা ক্যাবল', 'জ্যাকেট বা প্লাস্টিকের আবরণ', 'ইউটিপি বা কেসিং', 'কেসিং বা ক্যাবল', '2', NULL, NULL, '2020-07-03 04:12:44', '2020-07-03 04:12:44'),
(511, 42, 'কোন ক্যাবল ব্যাকবোন ক্যাবল হিসেবে সর্বাধিক ব্যবহৃত হয়?', NULL, 'ফাইবার অপটিক', 'টুইস্টেড পেয়্যার', 'অপটিক্যাল ফাইবার', 'কপার কেবল', '1', NULL, NULL, '2020-07-03 04:13:57', '2020-07-03 04:13:57'),
(512, 42, 'বর্তমানে যোগানকৃত ইউটিপি ক্যাবলের ডেটা ট্রান্সমিশন গতি সর্বোচ্চ কত এমবিপিএস?', NULL, '১০০', '৫০', '৫০০', '১০০০', '3', NULL, NULL, '2020-07-03 04:14:59', '2020-07-03 04:14:59'),
(513, 42, 'যখন কপার ওয়্যারসমূহ টুইস্টেড করা হয় তখন কী ফলাফল হয়?', NULL, 'EMI কমে', 'পরিবাহিকতা কমে', 'রোধকমে', 'তার স্থায়ী হয়', '1', NULL, NULL, '2020-07-03 04:16:46', '2020-07-03 04:16:46'),
(514, 42, 'অপটিক্যাল ফাইবার তৈরীতে কি ব্যবহার হয় না?', NULL, 'কাঁচ তন্তু', 'ইস্পাত', 'কপার', 'ফেরাস কোর', '3', NULL, NULL, '2020-07-03 04:20:04', '2020-07-03 04:20:04'),
(515, 42, 'নিচের কোনটি বর্তমানে প্রাপ্ত অপটিক্যাল ফাইবারের ডেটা পরিবহনের হারে সীমা নির্দেশক?', NULL, '1mbps - 100mbps', '100 mbps - 100 gbps', '1gbps - 100gbps', '100 mbps - 2 gbps', '2', NULL, NULL, '2020-07-03 04:21:39', '2020-07-03 04:21:39'),
(516, 43, 'কোন IEEE টি Wifi স্ট্যান্ডার্ড?', 71, '802.11', '802.11u', '802.15', '802.16', '1', NULL, NULL, '2020-07-03 04:24:21', '2020-07-03 04:24:21'),
(517, 43, 'WIMAX টাওয়ার চারদিকে সর্বোচ্চ কত মাইল পর্যন্ত সেবা দিতে পারে?', NULL, '১০', '২০', '৪০', '৫০', '4', NULL, NULL, '2020-07-03 04:25:16', '2020-07-03 04:25:16'),
(518, 43, 'কোন প্রযুক্তি ওয়্যারলেস প্যান এর জন্য ব্যবহার করা হয়?', NULL, 'ওয়াইম্যাক্স', 'টেরিস্টোরিয়াল', 'স্যাটেলাইট', 'ব্লু-টুথ', '4', NULL, NULL, '2020-07-03 04:26:39', '2020-07-03 04:26:39'),
(519, 43, 'ব্লুটুথের মাধ্যমে তৈরী নেটওয়ার্ককে বলে-', 81, 'LAN', 'PAN', 'MAN', 'WAN', '2', NULL, NULL, '2020-07-03 04:27:56', '2020-07-03 04:27:56'),
(520, 43, 'নিচের কোনটি Wifi স্ট্যান্ডার্ড?', 103, '802.10', '802.11', '802.01', '802.16', '2', NULL, NULL, '2020-07-03 04:29:50', '2020-07-03 04:29:50'),
(521, 43, 'পৃথিবী  থেকে কত উচ্চতায় স্যাটেলাইট স্থাপন করা হয়?', NULL, '1200km', '12000km', '24000km', '36000km', '4', NULL, NULL, '2020-07-03 04:31:02', '2020-07-03 04:31:02'),
(522, 43, 'একই সাথে অনেকগুলো দেশের সাথে যোগাযোগের জন্য নিচের কোনটি ব্যবহার করা হয়?', NULL, 'স্যাটেলাইট', 'অপটিক্যাল ফাইবার', 'টেরিস্ট্রোরিয়াল', 'ইনফ্রারেড', '1', NULL, NULL, '2020-07-03 04:32:15', '2020-07-03 04:32:15'),
(523, 43, 'রেডিও, মডেম এন্টেনা প্রয়োজন কোন ক্ষেত্রে?', NULL, 'ওয়্যারলেস ল্যান', 'ওয়্য্যারলেস ম্যান', 'ওয়্যারলেস প্যান', 'ওয়্যারলেস ওয়ান', '1', NULL, NULL, '2020-07-03 04:33:27', '2020-07-03 04:33:27'),
(524, 43, 'হটস্পট কি?', 104, 'নির্দিষ্ট উত্তপ্ত এলাকা', 'তারযুক্ত ইন্টারনেট ব্যবস্থা', 'তারবিহীন ইন্টারনেট ব্যবস্থা', 'বিশ্বব্যাপী ইন্টারনেট ব্যবস্থা', '3', NULL, NULL, '2020-07-03 04:34:59', '2020-07-03 04:34:59'),
(525, 43, 'কোনটি Wimax স্ট্যান্ডার্ড?', NULL, '802.15', '802.11a', '802.11b', '802.16', '4', NULL, NULL, '2020-07-03 04:35:50', '2020-07-03 04:35:50'),
(526, 43, 'স্যাটেলাইট মাইক্রোওয়েভ-এ ভি-স্যাট কোন দিকে মুখ করে থাকে?', NULL, 'আকাশ', 'মাটি', 'পানি', 'বায়ু', '1', NULL, NULL, '2020-07-03 04:36:53', '2020-07-03 04:36:53'),
(527, 43, 'ওয়াই ফাই হলো -', NULL, 'ওয়্যারলেস ল্যান', 'ওয়্যারলেস ম্য্যান', 'ওয়্যারলেস প্যান', 'ওয়্যারলেস ওয়ান', '1', NULL, NULL, '2020-07-03 04:40:19', '2020-07-03 04:40:19'),
(528, 43, 'মাইক্রোওয়েভ এর ফ্রিকুয়েন্সি রেঞ্জ কত?', NULL, '300MHz - 30GHz', '10KHz - 1GHz', '3KHz - 3MHz', '3GHz - 300GHz', '4', NULL, NULL, '2020-07-03 06:06:37', '2020-07-03 06:06:37'),
(529, 43, 'নিচের কোনটি ওয়্যারলেস ম্যান এর উদাহরণ?', NULL, 'ব্লুটুথ', 'Wi-max', 'স্যাটেলাইট', 'ইনফ্রারেড', '2', NULL, NULL, '2020-07-03 06:07:50', '2020-07-03 06:07:50'),
(530, 43, 'ওয়্যারলেস একসেস পয়েন্ট হলো-', NULL, 'হট স্পট', 'মডেম', 'রাউটার', 'সুইচ', '3', NULL, NULL, '2020-07-03 06:12:30', '2020-07-03 06:12:30'),
(531, 43, 'কত দুরত্ব পর্যন্ত Wi-max বেস স্টেশন ইন্টারনেট অ্যাকসেস সুবিধা প্রদান করে?', NULL, '70km - 100 km', '1 km - 8 km', '1 km - 60 km', '1 m - 1 km', '3', NULL, NULL, '2020-07-03 06:18:42', '2020-07-03 06:18:42'),
(532, 43, 'সাশ্রয়ীভাবে পাহাড়ি এলাকায় কার্যকরী নেটওয়ার্ক স্থাপনের জন্য কোন মাধ্যমটি সুবিধাজনক ?', 25, 'অপটিক্যাল ফাইবার', 'রেডিও ওয়েব', 'ওয়াইফাই', 'ওয়াইম্যাক্স', '4', NULL, NULL, '2020-07-03 06:21:53', '2020-07-03 06:21:53'),
(533, 44, 'মোবাইল ফোনের কোন প্রজন্ম হতে SMS সেবা চালু হয়?', NULL, 'প্রথম', 'দ্বিতীয়', 'তৃতীয়', 'চতুর্থ', '2', NULL, NULL, '2020-07-03 06:23:52', '2020-07-03 06:23:52'),
(534, 44, 'মোবাইলের কোন প্রজন্ম হতে ইন্টারনেট ব্যবহার শুরু হয়?', 26, '১ম', '২য়', '৩য়', '৪র্থ', '2', NULL, NULL, '2020-07-03 06:25:29', '2020-07-03 06:25:29'),
(535, 44, 'নিচের কোন প্রতিষ্ঠান ব্লুটুথ এর উদ্ভাবক?', NULL, 'স্যামসাং', 'এরিকসন', 'নোকিয়া', 'সনি', '2', NULL, NULL, '2020-07-03 06:26:21', '2020-07-03 06:26:21'),
(536, 44, 'কে মোবাইল ফোনের আবিষ্কারক?', NULL, 'জ্যাক উইলিয়ামসন', 'গ্রাহাম বেল', 'রিচার্ড ফাইনম্যান', 'ড. মার্টিন কুপার', '4', NULL, NULL, '2020-07-03 06:27:39', '2020-07-03 06:27:39'),
(537, 44, 'বানিজ্যিকভাবে 3G চালু হয় কবে থেকে -', NULL, '১৯৮৯', '১৯৯৫', '২০০১', '২০০৫', '3', NULL, NULL, '2020-07-03 06:28:33', '2020-07-03 06:28:33'),
(538, 44, 'ডেটা ট্রান্সফর্মার এর হার 4G নেটওয়ার্কে সর্বোচ্চ কত?', NULL, '10 mbps', '25 mbps', '50 mbps', '100 mbps', '4', NULL, NULL, '2020-07-03 06:30:13', '2020-07-03 06:30:13'),
(539, 44, 'কোনটি চতুর্থ প্রজন্মের মোবাইল ফোনের প্রধান বৈশিষ্ট্য?', 114, 'আইপি নির্ভর ওয়্যারলেস নেটওয়ার্ক', 'বিশ্বব্যাপী রোমিং সুবিধা', 'ফোনের মাধ্যমে ইন্টারনেট সংযোগ', 'সেমিকন্ডাক্টর ও মাইক্রোপ্রসেসর প্রযুক্তি', '1', NULL, NULL, '2020-07-03 06:32:59', '2020-07-03 06:32:59'),
(540, 44, 'GPRS এর পূর্ণরূপ-', 134, 'General Packet Radio Service', 'Global Packet Radio Service', 'Global Package Radio Service', 'General Package Radio Service', '1', NULL, NULL, '2020-07-03 06:34:25', '2020-07-03 06:34:25'),
(541, 44, 'GSM এর পূর্ণরূপ হলো-', NULL, 'General System for Mobile Communication', 'Global Standard for Mobile Communication', 'General Standard for Mobile Communication', 'Global System for Mobile Communication', '4', NULL, NULL, '2020-07-03 06:35:41', '2020-07-03 06:35:41'),
(542, 45, 'ব্লুটুথ এর মাধ্যমে কোন নেটওয়ার্ক তৈরি হয়?', NULL, 'PAN', 'LAN', 'WAN', 'MAN', '1', NULL, NULL, '2020-07-03 06:39:17', '2020-07-03 06:39:17'),
(543, 45, 'ক্লায়েন্ট সার্ভার নেটওয়ার্ক ব্যবহৃত হয় কোন ক্ষেত্রে?', 82, 'PAN', 'LAN', 'MAN', 'WAN', '2', NULL, NULL, '2020-07-03 06:42:40', '2020-07-03 06:42:40'),
(544, 45, 'সর্ববৃহৎ এলাকা জুড়ে কোন নেটওয়ার্কটি তৈরি হয়?', NULL, 'PAN', 'LAN', 'MAN', 'WAN', '4', NULL, NULL, '2020-07-03 06:43:42', '2020-07-03 06:43:42'),
(545, 45, 'একই ভবনের বিভিন্ন কক্ষে রক্ষিত কম্পিউটারের মধ্যে নেটওয়ার্ক ব্যবস্থাকে কী বলে?', 104, 'PAN', 'LAN', 'MAN', 'WAN', '2', NULL, NULL, '2020-07-03 06:45:19', '2020-07-03 06:45:19'),
(546, 45, 'WAN এর উদাহরণ কোনটি?', NULL, 'রেডিও', 'টেলিফোন', 'ইন্টারনেট', 'টেলিভিশন', '3', NULL, NULL, '2020-07-03 06:46:19', '2020-07-03 06:46:19'),
(547, 45, 'কোন নেটওয়ার্ক সিস্টেমের ব্যাপ্তি কয়েক মিটারের মধ্যে সীমাবদ্ধ?', NULL, 'LAN', 'MAN', 'WAN', 'PAN', '4', NULL, NULL, '2020-07-03 06:47:10', '2020-07-03 06:47:10'),
(548, 45, 'একই ভবনের বিভিন্ন কক্ষে রক্ষিত কম্পিউটারের মধ্যে নেটওয়ার্ক ব্যবস্থাকে কী বলে?', NULL, 'LAN', 'CAN', 'PAN', 'WAN', '1', NULL, NULL, '2020-07-03 06:47:52', '2020-07-03 06:47:52'),
(549, 45, 'পাশাপাশি দু’টি ভবনে বিভিন্ন তলায় অবস্থিত ৫টি কম্পিউটার থেকে ১টি প্রিন্টারে প্রিন্ট সুবিধা প্রদান করতে হলে কোন ধরনের প্রযুক্তি সেবা সর্বাধিক যুক্তিযুক্ত?', 125, 'PAN', 'MAN', 'WAN', 'LAN', '4', NULL, NULL, '2020-07-03 06:49:21', '2020-07-03 06:49:21'),
(550, 45, 'দশটি কম্পিউটার একটি তারের সাথে সংযুক্ত থাকলে সেটি কোন ধরনের নেটওয়ার্ক?', 125, 'স্টার', 'বাস', 'রিং', 'হাইব্রিড', '2', NULL, NULL, '2020-07-03 06:51:42', '2020-07-03 06:51:42'),
(551, 46, 'কয়েকটি ভিন্ন নেটওয়ার্ক যুক্ত করার জন্য ব্যবহৃত ডিভাইস কোনটি?', NULL, 'সুইচ', 'রাউটার', 'হাব', 'গেটওয়ে', '2', NULL, NULL, '2020-07-03 07:12:42', '2020-07-03 07:12:42'),
(552, 46, 'নিচের কোন ডিভাইসটিতে ডেটা ফিল্টারিং সম্ভব?', 71, 'হাব', 'সুইচ', 'রিপিটার', 'রাউটার', '4', NULL, NULL, '2020-07-03 07:14:06', '2020-07-03 07:14:06'),
(553, 46, 'ভিন্ন ভিন্ন প্রটোকল বিশিষ্ট নেটওয়ার্ক সংযুক্ত করতে নিচের কোন ডিভাইসটি ব্যবহার করতে হয়?', NULL, 'Switch', 'Gateway', 'HUB', 'LAN Card', '2', NULL, NULL, '2020-07-03 07:15:39', '2020-07-03 07:15:39'),
(554, 46, 'স্টার টপোলজিতে কোন ডিভাইসটি ব্যবহৃত হয়?', 26, 'হাব', 'মডেম', 'রাউটার', 'রিপিটার', '1', NULL, NULL, '2020-07-03 07:17:12', '2020-07-03 07:17:12'),
(555, 46, 'স্টার টপোলজিতে কোন ডিভাইসটি ব্যবহৃত হয়?', 49, 'হাব', 'মডেম', 'রাউটার', 'রিপিটার', '1', NULL, NULL, '2020-07-03 07:17:12', '2020-07-03 07:17:12'),
(556, 46, 'মডেমের অ্যানালগ সংকেতকে ডিজিটাল সংকেতে পরিণত করার কাজকে কি বলে?', NULL, 'মডুলেশন', 'ডিমডুলেশন', 'ব্রডকাস্ট', 'হাফ-ডুপ্লেক্স', '1', NULL, NULL, '2020-07-03 07:19:33', '2020-07-03 07:19:33'),
(557, 46, 'কোন ডিভাইসের মাধ্যমে অ্যানালগ সংকেতকে ডিজিটাল সংকেতে রূপান্তরিত হয়?', 126, 'রাউটার', 'সুইচ', 'রিপিটার', 'মডেম', '4', NULL, NULL, '2020-07-03 07:21:06', '2020-07-03 07:21:06'),
(558, 46, 'নিচের কোনটি Modulator অথবা Demodulator বুঝায়?', NULL, 'Modem', 'Demodulate', 'Modulate', 'Module', '1', NULL, NULL, '2020-07-03 07:23:28', '2020-07-03 07:23:28'),
(559, 47, 'নিচের কোন নেটওয়ার্কে প্রতিটি কম্পিউটার তার দু\'দিকের কম্পিউটারের সাথে সংযুক্ত থাকে?', NULL, 'বাস সংগঠন', 'শাখা-প্রশাখা সংগঠন', 'স্টার সংগঠন', 'রিং সংগঠন', '4', NULL, NULL, '2020-07-03 07:25:35', '2020-07-03 07:25:35'),
(560, 47, 'কম্পিউটার নেটওয়ার্কিং এর জন্য কয় ধরনের টপোলজি ব্যবহার করা হয়?', 38, '৩', '৪', '৫', '৬', '4', NULL, NULL, '2020-07-03 07:26:29', '2020-07-03 07:26:29'),
(561, 47, 'কেন্দ্রীয় কম্পিউটার বা ডিভাইস থাকে নেটওয়ার্কের কোন সংগঠনে?', NULL, 'সংকর সংগঠন', 'স্টার সংগঠন', 'বাস সংগঠন', 'ট্রাক সংগঠন', '2', NULL, NULL, '2020-07-03 07:27:37', '2020-07-03 07:27:37'),
(562, 47, 'কোনটি NETWORK TOPOLOGY?', NULL, 'LAN', 'BUS', 'WAN', 'MAN', '2', NULL, NULL, '2020-07-03 07:28:13', '2020-07-03 07:28:13'),
(563, 47, 'একটি কেন্দ্রীয় হাব দ্বারা কোন টপোলজি সংযুক্ত থাকে?', 71, 'BUS', 'MESH', 'RING', 'STAR', '4', NULL, NULL, '2020-07-03 07:31:55', '2020-07-03 07:31:55'),
(564, 47, 'কোন ব্যবস্থায় কোনো কেন্দ্রীয় কম্পিউটার থাকে না?', NULL, 'রিং টপোলজি', 'স্টার টপোলজি', 'বাস টপোলজি', 'মেগা টপোলজি', '1', NULL, NULL, '2020-07-03 07:32:53', '2020-07-03 07:32:53'),
(565, 47, 'একটি কেন্দ্রীয় নিয়ন্ত্রিত কম্পিউটারের সঙ্গে একাধিক কম্পিউটার সংযুক্ত হওয়ার সংগঠনের নাম কি?', NULL, 'সংকর সংগঠন', 'রিং সংগঠন', 'বাস সংগঠন', 'স্টার সংগঠন', '4', NULL, NULL, '2020-07-03 07:34:37', '2020-07-03 07:34:37'),
(566, 48, 'ক্লাউড কম্পিউটিং এর সুফল কোনটি?', 71, 'সাশ্রয়ী ও সহজলভ্য', 'ইন্টারনেট সংযোগ লাগে না', 'এপ্লিকেশনের উপর নিয়ন্ত্রণ রাখা যায়', 'তথ্যের গোপনীয়তা বজায় থাকে', '1', NULL, NULL, '2020-07-03 07:36:40', '2020-07-03 07:36:40'),
(567, 48, 'স্বয়ংক্রিয়ভাবে আপডেটেড সফটওয়্যার সেবার ক্ষেত্রে কোনটি সর্বোত্তম?', 125, 'ব্যবহৃত সফটওয়্যারের স্বয়ংক্রিয় আপডেট অন রাখা', 'নেটওয়ার্কের আওতায় সফটওয়্যার সেবা গ্রহণ', 'ক্লাউডভিত্তিক সফটওয়্যার ব্যবহার', 'পাইরেটেড সফটওয়্যার এড়িয়ে চলা', '3', NULL, NULL, '2020-07-03 07:39:52', '2020-07-03 07:39:52');

-- --------------------------------------------------------

--
-- Table structure for table `results`
--

CREATE TABLE `results` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `total_question` int(11) NOT NULL,
  `correct_answer` int(11) NOT NULL,
  `wrong_answer` int(11) NOT NULL,
  `correct_answer_question_id` longtext NOT NULL,
  `wrong_answer_question_id` longtext NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `results`
--

INSERT INTO `results` (`id`, `user_id`, `total_question`, `correct_answer`, `wrong_answer`, `correct_answer_question_id`, `wrong_answer_question_id`, `created_at`, `updated_at`) VALUES
(73, 1, 3, 2, 1, '[9,10]', '[11]', '2020-04-12 23:27:51', '2020-04-12 23:27:51'),
(74, 1, 3, 2, 1, '[9,10]', '[11]', '2020-04-12 23:34:27', '2020-04-12 23:34:27'),
(75, 1, 3, 2, 1, '[9,10]', '[11]', '2020-04-12 23:34:54', '2020-04-12 23:34:54'),
(76, 1, 3, 2, 1, '[9,10]', '[11]', '2020-04-12 23:35:17', '2020-04-12 23:35:17'),
(77, 1, 3, 2, 1, '[9,10]', '[11]', '2020-04-12 23:37:16', '2020-04-12 23:37:16'),
(78, 1, 1, 0, 1, '[]', '[9]', '2020-04-13 07:13:36', '2020-04-13 07:13:36'),
(79, 1, 1, 0, 1, '[]', '[9]', '2020-04-13 07:40:09', '2020-04-13 07:40:09'),
(80, 1, 4, 2, 2, '[9,12]', '[10,11]', '2020-04-13 08:11:27', '2020-04-13 08:11:27'),
(81, 1, 1, 0, 1, '[]', '[10]', '2020-04-13 08:26:16', '2020-04-13 08:26:16'),
(82, 1, 1, 1, 0, '[10]', '[]', '2020-04-13 08:26:37', '2020-04-13 08:26:37'),
(83, 1, 1, 0, 1, '[]', '[10]', '2020-04-13 10:32:18', '2020-04-13 10:32:18'),
(84, 1, 1, 0, 1, '[]', '[9]', '2020-04-13 12:44:56', '2020-04-13 12:44:56'),
(85, 1, 4, 0, 4, '[]', '[9,10,11,12]', '2020-04-13 13:38:30', '2020-04-13 13:38:30'),
(86, 1, 4, 1, 3, '[12]', '[9,10,11]', '2020-04-15 12:16:35', '2020-04-15 12:16:35'),
(87, 1, 4, 0, 4, '[]', '[9,10,11,12]', '2020-04-17 10:15:23', '2020-04-17 10:15:23'),
(88, 1, 2, 0, 2, '[]', '[486,532]', '2020-07-03 14:03:42', '2020-07-03 14:03:42'),
(89, 1, 4, 1, 3, '[335]', '[226,362,409]', '2020-07-03 14:35:02', '2020-07-03 14:35:02'),
(90, 1, 7, 2, 5, '[335,486]', '[226,362,409,419,532]', '2020-07-03 16:37:49', '2020-07-03 16:37:49'),
(91, 1, 2, 2, 0, '[226,335]', '[]', '2020-07-04 02:02:14', '2020-07-04 02:02:14'),
(92, 1, 7, 4, 3, '[57,87,91,92]', '[88,89,90]', '2020-07-04 02:23:14', '2020-07-04 02:23:14');

-- --------------------------------------------------------

--
-- Table structure for table `topics`
--

CREATE TABLE `topics` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `chapter_id` bigint(20) UNSIGNED NOT NULL,
  `topic_name` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `topics`
--

INSERT INTO `topics` (`id`, `chapter_id`, `topic_name`, `created_at`, `updated_at`) VALUES
(2, 2, 'তথ্য ও যোগাযোগ প্রযুক্তি', '2020-05-17 07:12:47', '2020-05-17 07:12:47'),
(4, 2, 'বিশ্বগ্রামের ধারণা', '2020-05-22 09:41:44', '2020-05-22 09:41:44'),
(5, 3, 'সংখ্যা পদ্ধতির ইতিহাস', '2020-06-08 23:28:00', '2020-06-08 23:28:00'),
(6, 3, 'সংখ্যা পদ্ধতির ইতিহাস', '2020-06-09 02:59:33', '2020-06-09 02:59:33'),
(7, 2, 'ভার্চুয়াল রিয়েলিটি', '2020-06-09 14:48:55', '2020-06-09 14:48:55'),
(8, 3, 'সংখ্যা পদ্ধতি', '2020-06-10 07:17:33', '2020-06-10 07:17:33'),
(9, 3, 'বাইনারী', '2020-06-10 07:33:39', '2020-06-10 07:33:39'),
(10, 3, 'সংখ্যা পদ্ধতির প্রকারভেদ', '2020-06-10 07:36:05', '2020-06-10 07:36:05'),
(11, 2, 'কৃত্রিম বুদ্ধিমত্তা', '2020-06-10 08:45:58', '2020-06-10 08:45:58'),
(12, 3, 'ডেসিমাল', '2020-06-10 09:23:49', '2020-06-10 09:23:49'),
(13, 3, 'হেক্সাডেসিমাল', '2020-06-11 04:18:04', '2020-06-11 04:18:04'),
(14, 3, 'বাইনারি যোগ ও বিয়োগ', '2020-06-11 04:23:21', '2020-06-11 04:23:21'),
(15, 3, '২ এর পরিপূরক গঠন', '2020-06-11 09:15:30', '2020-06-11 09:15:30'),
(16, 2, 'রোবোটিক্স', '2020-06-11 10:00:42', '2020-06-11 10:00:42'),
(17, 3, 'কম্পিউটার কোডিং', '2020-06-11 10:01:05', '2020-06-11 10:01:05'),
(18, 3, 'বিসিডি কোড', '2020-06-11 10:26:43', '2020-06-11 10:26:43'),
(19, 3, 'আলফা-নিউমারিক কোড', '2020-06-11 22:57:50', '2020-06-11 22:57:50'),
(20, 3, 'ইবিসিডিআইসি কোড', '2020-06-11 23:25:04', '2020-06-11 23:25:04'),
(21, 3, 'আসকি কোড', '2020-06-11 23:27:39', '2020-06-11 23:27:39'),
(22, 3, 'ইউনিকোড', '2020-06-12 07:56:51', '2020-06-12 07:56:51'),
(23, 7, 'ডেটাবেজের ধারণা', '2020-06-29 02:55:09', '2020-06-29 02:55:09'),
(24, 7, 'DBMS', '2020-06-29 05:43:40', '2020-06-29 05:43:40'),
(25, 7, 'ডেটাবেজ রিলেশন', '2020-06-29 06:30:24', '2020-06-29 06:30:24'),
(26, 7, 'ডেটাবেজ', '2020-06-29 06:37:35', '2020-06-29 06:37:35'),
(27, 8, 'প্রোগ্রাম ডিজাইন', '2020-06-29 09:29:38', '2020-06-29 09:29:38'),
(28, 8, 'সি প্রোগ্রামিং', '2020-06-30 04:41:55', '2020-06-30 04:41:55'),
(29, 9, 'Introduction to web Design and HTML', '2020-06-30 06:26:50', '2020-06-30 06:26:50'),
(30, 11, 'বুলিয়ান অ্যালজেবরা', '2020-07-02 03:12:43', '2020-07-02 03:12:43'),
(31, 11, 'ডি-মরগ্যানের সুত্র', '2020-07-02 03:25:26', '2020-07-02 03:25:26'),
(32, 11, 'লজিক গেইট', '2020-07-02 03:34:58', '2020-07-02 03:34:58'),
(33, 11, 'অর গেইট', '2020-07-02 03:43:32', '2020-07-02 03:43:32'),
(34, 11, 'এন্ড গেইট', '2020-07-02 03:53:43', '2020-07-02 03:53:43'),
(35, 11, 'নট গেইট', '2020-07-02 04:03:39', '2020-07-02 04:03:39'),
(36, 11, 'সার্বজনীন গেইট', '2020-07-02 04:20:21', '2020-07-02 04:20:21'),
(37, 11, 'ডিকোডার ও এনকোডার', '2020-07-02 04:24:56', '2020-07-02 04:24:56'),
(38, 12, 'ডেটা কমিউনিকেশন সিস্টেম', '2020-07-02 11:53:04', '2020-07-02 11:53:04'),
(39, 12, 'ব্যান্ডউইথ', '2020-07-02 12:02:33', '2020-07-02 12:02:33'),
(40, 12, 'ডেটা ট্রান্সমিশন মেথড', '2020-07-02 12:31:27', '2020-07-02 12:31:27'),
(41, 12, 'ডেটা ট্রান্সমিশন মোড', '2020-07-03 03:08:02', '2020-07-03 03:08:02'),
(42, 12, 'ডেটা কমিউনিকেশন মিডিয়া ঃ কেবল মাধ্যম', '2020-07-03 03:33:43', '2020-07-03 03:33:43'),
(43, 12, 'ওয়্যারলেস কমিউনিকেশন সিস্টেম', '2020-07-03 04:22:35', '2020-07-03 04:22:35'),
(44, 12, 'মোবাইল যোগাযোগ', '2020-07-03 06:22:20', '2020-07-03 06:22:20'),
(45, 12, 'কম্পিউটার নেটওয়ার্ক', '2020-07-03 06:38:26', '2020-07-03 06:38:26'),
(46, 12, 'নেটওয়ার্ক স্থাপনে জরুরী যন্ত্রপাতি', '2020-07-03 07:11:50', '2020-07-03 07:11:50'),
(47, 12, 'নেটওয়ার্ক টপোলজি', '2020-07-03 07:23:59', '2020-07-03 07:23:59'),
(48, 12, 'ক্লাউড কম্পিউটিং', '2020-07-03 07:35:12', '2020-07-03 07:35:12');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `phone` varchar(100) DEFAULT NULL,
  `institute` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `phone`, `institute`, `created_at`, `updated_at`) VALUES
(1, 'Mazharul alam', '01876626011', 'Baitussharaf', '2020-07-03 19:57:32', '2020-07-03 19:57:32');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `board_lists`
--
ALTER TABLE `board_lists`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `chapters`
--
ALTER TABLE `chapters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `questions_topic_id_foreign` (`topic_id`);

--
-- Indexes for table `results`
--
ALTER TABLE `results`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `topics`
--
ALTER TABLE `topics`
  ADD PRIMARY KEY (`id`),
  ADD KEY `topics_chapter_id_foreign` (`chapter_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `board_lists`
--
ALTER TABLE `board_lists`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=135;

--
-- AUTO_INCREMENT for table `chapters`
--
ALTER TABLE `chapters`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=568;

--
-- AUTO_INCREMENT for table `results`
--
ALTER TABLE `results`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=93;

--
-- AUTO_INCREMENT for table `topics`
--
ALTER TABLE `topics`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `questions`
--
ALTER TABLE `questions`
  ADD CONSTRAINT `questions_topic_id_foreign` FOREIGN KEY (`topic_id`) REFERENCES `topics` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `topics`
--
ALTER TABLE `topics`
  ADD CONSTRAINT `topics_chapter_id_foreign` FOREIGN KEY (`chapter_id`) REFERENCES `chapters` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
